{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}X:\Career\Github\Pay_Equity_Analysis_Project\STATA Commands\dissertation_analysis_outputs.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Nov 2025, 22:41:15
{txt}
{com}. 
. 
. * STEP 1: LOAD PREPARED DATA
. 
. use "X:\Projects\STATA-Pr\gssap.dta", clear
{txt}
{com}. 
. 
. * STEP 2: SET SURVEY DESIGN
. 
. svyset FSU [pweight=weight], strata(Stratum)

{txt}Sampling weights:{col 19}{res}weight
             {txt}VCE:{col 19}{res}linearized
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}{res}Stratum
 {txt}Sampling unit 1:{col 19}{res}FSU
           {txt}FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. 
. * STEP 3: DATA CLEANING
. 
. capture drop dum_*
{txt}
{com}. 
. 
. * STEP 4: DUMMY VARIABLE CREATION FOR OAXACA 
. 
. 
. tab GenEdu, gen(dum_GenEdu)

          {txt}GenEdu {c |}      Freq.     Percent        Cum.
{hline 17}{c +}{hline 35}
      Illiterate {c |}{res}    810,820       20.09       20.09
{txt}Up to HS/Diploma {c |}{res}  2,704,793       67.01       87.09
{txt}       Graduate+ {c |}{res}    521,084       12.91      100.00
{txt}{hline 17}{c +}{hline 35}
           Total {c |}{res}  4,036,697      100.00
{txt}
{com}. tab TechEdu, gen(dum_TechEdu)

    {txt}TechEdu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       None {c |}{res}  3,894,098       96.47       96.47
{txt}    Diploma {c |}{res}     82,561        2.05       98.51
{txt}  Graduate+ {c |}{res}     60,033        1.49      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  4,036,692      100.00
{txt}
{com}. tab HHSize, gen(dum_HHSize)

  {txt}RECODE of {c |}
 b3q1_hh_fv {c |}
 (Household {c |}
      Size) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
1-3 members {c |}{res}    954,844       23.63       23.63
{txt}        4-6 {c |}{res}  2,438,296       60.35       83.98
{txt}       7-10 {c |}{res}    567,842       14.05       98.04
{txt}      11-17 {c |}{res}     76,917        1.90       99.94
{txt}        18+ {c |}{res}      2,419        0.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  4,040,318      100.00
{txt}
{com}. tab Trained, gen(dum_Trained)

   {txt}Received {c |}
   Training {c |}
     (0=No, {c |}
     1=Yes) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}  2,411,726       82.33       82.33
{txt}        Yes {c |}{res}    517,671       17.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  2,929,397      100.00
{txt}
{com}. tab SocialGroup, gen(dum_SG)

     {txt}Social {c |}
      Group {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         ST {c |}{res}    490,314       12.14       12.14
{txt}         SC {c |}{res}    646,397       16.00       28.13
{txt}        OBC {c |}{res}  1,614,470       39.96       68.09
{txt}     Others {c |}{res}  1,289,137       31.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  4,040,318      100.00
{txt}
{com}. tab MaritalStatus, gen(dum_MarStat)

    {txt}Marital Status {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
     Never Married {c |}{res}  1,778,734       44.06       44.06
{txt} Currently Married {c |}{res}  1,992,780       49.37       93.43
{txt}           Widowed {c |}{res}    246,283        6.10       99.53
{txt}Divorced/Separated {c |}{res}     18,863        0.47      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}  4,036,660      100.00
{txt}
{com}. 
. 
. * STEP 5: GLOBAL VARIABLE DEFINITIONS 
. 
. * For the `regress` command where factor variables work
. global mincer_vars "i.GenEdu i.TechEdu i.HHSize i.Trained i.SocialGroup i.MaritalStatus Age_cont Age_sq_cont"
{txt}
{com}. 
. * For the `oaxaca` command for which dummy variables were created
. 
. global oaxaca_vars "dum_GenEdu2 dum_GenEdu3 dum_TechEdu2 dum_TechEdu3 dum_HHSize2 dum_HHSize3 dum_HHSize4 dum_HHSize5 dum_Trained2 dum_SG2 dum_SG3 dum_SG4 dum_MarStat2 dum_MarStat3 dum_MarStat4 Age_cont Age_sq_cont"
{txt}
{com}. 
. 
. * STEP 6: RAW WAGE GAP ANALYSIS (FOR ALL-INDIA) 
. 
. display "--- Part 6.1: Rural Regular Salaried (Raw Gap) ---"
{res}--- Part 6.1: Rural Regular Salaried (Raw Gap) ---
{txt}
{com}. svy: mean lnRegWage if Sector == 1 & Occupation == 2, over(Year Sex)
{res}{txt}(running {bf:mean} on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:7}{txt}{col 42}{lalign 15:Number of obs}{col 57} = {res}{ralign 11:65,956}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:13,332}{txt}{col 42}{lalign 15:Population size}{col 57} = {res}{ralign 11:707,534,486}
{txt}{col 42}{lalign 15:Design df}{col 57} = {res}{ralign 11:13,325}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}{col 34}  Linearized
{col 22}{c |}       Mean{col 34}   std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.lnRegWage@Year#Sex {c |}
{space 10}2018#Male  {c |}{col 22}{res}{space 2} 9.353711{col 34}{space 2} .0149657{col 45}{space 5} 9.324376{col 59}{space 3} 9.383046
{txt}{space 8}2018#Female  {c |}{col 22}{res}{space 2} 8.832679{col 34}{space 2} .0419769{col 45}{space 5} 8.750398{col 59}{space 3} 8.914959
{txt}{space 10}2019#Male  {c |}{col 22}{res}{space 2} 9.353711{col 34}{space 2} .0149657{col 45}{space 5} 9.324376{col 59}{space 3} 9.383046
{txt}{space 8}2019#Female  {c |}{col 22}{res}{space 2} 8.832679{col 34}{space 2} .0419769{col 45}{space 5} 8.750398{col 59}{space 3} 8.914959
{txt}{space 10}2020#Male  {c |}{col 22}{res}{space 2} 9.379977{col 34}{space 2} .0169225{col 45}{space 5} 9.346806{col 59}{space 3} 9.413147
{txt}{space 8}2020#Female  {c |}{col 22}{res}{space 2} 8.939666{col 34}{space 2} .0374427{col 45}{space 5} 8.866273{col 59}{space 3}  9.01306
{txt}{space 10}2022#Male  {c |}{col 22}{res}{space 2} 9.481991{col 34}{space 2} .0187484{col 45}{space 5} 9.445242{col 59}{space 3} 9.518741
{txt}{space 8}2022#Female  {c |}{col 22}{res}{space 2} 8.931405{col 34}{space 2} .0447221{col 45}{space 5} 8.843744{col 59}{space 3} 9.019067
{txt}{space 10}2023#Male  {c |}{col 22}{res}{space 2} 9.582102{col 34}{space 2} .0200071{col 45}{space 5} 9.542885{col 59}{space 3} 9.621319
{txt}{space 8}2023#Female  {c |}{col 22}{res}{space 2} 9.183293{col 34}{space 2} .0429777{col 45}{space 5}  9.09905{col 59}{space 3} 9.267535
{txt}{space 10}2024#Male  {c |}{col 22}{res}{space 2} 9.668127{col 34}{space 2} .0128544{col 45}{space 5} 9.642931{col 59}{space 3} 9.693324
{txt}{space 8}2024#Female  {c |}{col 22}{res}{space 2} 9.206013{col 34}{space 2} .0331804{col 45}{space 5} 9.140975{col 59}{space 3} 9.271052
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. display "--- Part 6.2: Urban Regular Salaried (Raw Gap) ---"
{res}--- Part 6.2: Urban Regular Salaried (Raw Gap) ---
{txt}
{com}. svy: mean lnRegWage if Sector == 2 & Occupation == 2, over(Year Sex)
{res}{txt}(running {bf:mean} on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:6}{txt}{col 40}{lalign 15:Number of obs}{col 55} = {res}{ralign 13:368,251}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:15,642}{txt}{col 40}{lalign 15:Population size}{col 55} = {res}{ralign 13:2,773,000,405}
{txt}{col 40}{lalign 15:Design df}{col 55} = {res}{ralign 13:15,636}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}{col 34}  Linearized
{col 22}{c |}       Mean{col 34}   std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.lnRegWage@Year#Sex {c |}
{space 10}2018#Male  {c |}{col 22}{res}{space 2} 9.576301{col 34}{space 2} .0143765{col 45}{space 5} 9.548121{col 59}{space 3}  9.60448
{txt}{space 8}2018#Female  {c |}{col 22}{res}{space 2} 9.252194{col 34}{space 2}  .030192{col 45}{space 5} 9.193014{col 59}{space 3} 9.311374
{txt}{space 10}2019#Male  {c |}{col 22}{res}{space 2} 9.576301{col 34}{space 2} .0143765{col 45}{space 5} 9.548121{col 59}{space 3}  9.60448
{txt}{space 8}2019#Female  {c |}{col 22}{res}{space 2} 9.252194{col 34}{space 2}  .030192{col 45}{space 5} 9.193014{col 59}{space 3} 9.311374
{txt}{space 10}2020#Male  {c |}{col 22}{res}{space 2} 9.679797{col 34}{space 2}  .015145{col 45}{space 5} 9.650111{col 59}{space 3} 9.709483
{txt}{space 8}2020#Female  {c |}{col 22}{res}{space 2} 9.330607{col 34}{space 2} .0367088{col 45}{space 5} 9.258654{col 59}{space 3} 9.402561
{txt}{space 10}2022#Male  {c |}{col 22}{res}{space 2} 9.714336{col 34}{space 2} .0167973{col 45}{space 5} 9.681411{col 59}{space 3}  9.74726
{txt}{space 8}2022#Female  {c |}{col 22}{res}{space 2} 9.373713{col 34}{space 2}  .035268{col 45}{space 5} 9.304584{col 59}{space 3} 9.442842
{txt}{space 10}2023#Male  {c |}{col 22}{res}{space 2} 9.872389{col 34}{space 2} .0144374{col 45}{space 5}  9.84409{col 59}{space 3} 9.900688
{txt}{space 8}2023#Female  {c |}{col 22}{res}{space 2} 9.516878{col 34}{space 2}   .03549{col 45}{space 5} 9.447313{col 59}{space 3} 9.586442
{txt}{space 10}2024#Male  {c |}{col 22}{res}{space 2} 9.944694{col 34}{space 2}  .011787{col 45}{space 5}  9.92159{col 59}{space 3} 9.967798
{txt}{space 8}2024#Female  {c |}{col 22}{res}{space 2} 9.580898{col 34}{space 2} .0230932{col 45}{space 5} 9.535633{col 59}{space 3} 9.626164
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. display "--- Part 6.3: Rural Self-Employed (Raw Gap) ---"
{res}--- Part 6.3: Rural Self-Employed (Raw Gap) ---
{txt}
{com}. svy: mean lnSelfWage if Sector == 1 & Occupation == 1, over(Year Sex)
{res}{txt}(running {bf:mean} on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:7}{txt}{col 41}{lalign 15:Number of obs}{col 56} = {res}{ralign 13:207,376}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:16,567}{txt}{col 41}{lalign 15:Population size}{col 56} = {res}{ralign 13:2,638,514,803}
{txt}{col 41}{lalign 15:Design df}{col 56} = {res}{ralign 13:16,560}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}{col 35}  Linearized
{col 23}{c |}       Mean{col 35}   std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.lnSelfWage@Year#Sex {c |}
{space 11}2018#Male  {c |}{col 23}{res}{space 2} 8.927566{col 35}{space 2} .0086735{col 46}{space 5} 8.910565{col 60}{space 3} 8.944567
{txt}{space 9}2018#Female  {c |}{col 23}{res}{space 2}  8.10186{col 35}{space 2} .0317969{col 46}{space 5} 8.039534{col 60}{space 3} 8.164185
{txt}{space 11}2019#Male  {c |}{col 23}{res}{space 2} 8.927566{col 35}{space 2} .0086735{col 46}{space 5} 8.910565{col 60}{space 3} 8.944567
{txt}{space 9}2019#Female  {c |}{col 23}{res}{space 2}  8.10186{col 35}{space 2} .0317969{col 46}{space 5} 8.039534{col 60}{space 3} 8.164185
{txt}{space 11}2020#Male  {c |}{col 23}{res}{space 2} 9.018529{col 35}{space 2} .0083489{col 46}{space 5} 9.002164{col 60}{space 3} 9.034894
{txt}{space 9}2020#Female  {c |}{col 23}{res}{space 2} 8.250539{col 35}{space 2} .0225358{col 46}{space 5} 8.206366{col 60}{space 3} 8.294711
{txt}{space 11}2022#Male  {c |}{col 23}{res}{space 2}  9.07093{col 35}{space 2} .0085392{col 46}{space 5} 9.054192{col 60}{space 3} 9.087668
{txt}{space 9}2022#Female  {c |}{col 23}{res}{space 2} 8.238979{col 35}{space 2} .0218363{col 46}{space 5} 8.196177{col 60}{space 3}  8.28178
{txt}{space 11}2023#Male  {c |}{col 23}{res}{space 2} 9.378232{col 35}{space 2} .0444826{col 46}{space 5} 9.291042{col 60}{space 3} 9.465423
{txt}{space 9}2023#Female  {c |}{col 23}{res}{space 2} 8.333251{col 35}{space 2} .0173698{col 46}{space 5} 8.299204{col 60}{space 3} 8.367297
{txt}{space 11}2024#Male  {c |}{col 23}{res}{space 2} 9.405079{col 35}{space 2} .0076139{col 46}{space 5} 9.390155{col 60}{space 3} 9.420003
{txt}{space 9}2024#Female  {c |}{col 23}{res}{space 2} 8.281055{col 35}{space 2} .0171411{col 46}{space 5} 8.247457{col 60}{space 3} 8.314653
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. display "--- Part 6.4: Urban Self-Employed (Raw Gap) ---"
{res}--- Part 6.4: Urban Self-Employed (Raw Gap) ---
{txt}
{com}. svy: mean lnSelfWage if Sector == 2 & Occupation == 1, over(Year Sex)
{res}{txt}(running {bf:mean} on estimation sample)
{res}
{txt}Survey: Mean estimation

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:6}{txt}{col 41}{lalign 15:Number of obs}{col 56} = {res}{ralign 13:257,111}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:15,185}{txt}{col 41}{lalign 15:Population size}{col 56} = {res}{ralign 13:1,759,196,040}
{txt}{col 41}{lalign 15:Design df}{col 56} = {res}{ralign 13:15,179}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}{col 35}  Linearized
{col 23}{c |}       Mean{col 35}   std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.lnSelfWage@Year#Sex {c |}
{space 11}2018#Male  {c |}{col 23}{res}{space 2} 9.463141{col 35}{space 2} .0151415{col 46}{space 5} 9.433462{col 60}{space 3}  9.49282
{txt}{space 9}2018#Female  {c |}{col 23}{res}{space 2} 8.560154{col 35}{space 2} .0877449{col 46}{space 5} 8.388164{col 60}{space 3} 8.732145
{txt}{space 11}2019#Male  {c |}{col 23}{res}{space 2} 9.463141{col 35}{space 2} .0151415{col 46}{space 5} 9.433462{col 60}{space 3}  9.49282
{txt}{space 9}2019#Female  {c |}{col 23}{res}{space 2} 8.560154{col 35}{space 2} .0877449{col 46}{space 5} 8.388164{col 60}{space 3} 8.732145
{txt}{space 11}2020#Male  {c |}{col 23}{res}{space 2} 9.550692{col 35}{space 2} .0197544{col 46}{space 5} 9.511971{col 60}{space 3} 9.589413
{txt}{space 9}2020#Female  {c |}{col 23}{res}{space 2} 8.612574{col 35}{space 2}  .053292{col 46}{space 5} 8.508116{col 60}{space 3} 8.717033
{txt}{space 11}2022#Male  {c |}{col 23}{res}{space 2} 9.531736{col 35}{space 2}  .014274{col 46}{space 5} 9.503757{col 60}{space 3} 9.559715
{txt}{space 9}2022#Female  {c |}{col 23}{res}{space 2} 8.481894{col 35}{space 2} .0639484{col 46}{space 5} 8.356548{col 60}{space 3} 8.607241
{txt}{space 11}2023#Male  {c |}{col 23}{res}{space 2} 9.768221{col 35}{space 2} .0146514{col 46}{space 5} 9.739503{col 60}{space 3}  9.79694
{txt}{space 9}2023#Female  {c |}{col 23}{res}{space 2} 8.742409{col 35}{space 2} .0469204{col 46}{space 5} 8.650439{col 60}{space 3} 8.834378
{txt}{space 11}2024#Male  {c |}{col 23}{res}{space 2} 9.868928{col 35}{space 2} .0116667{col 46}{space 5} 9.846059{col 60}{space 3} 9.891796
{txt}{space 9}2024#Female  {c |}{col 23}{res}{space 2} 8.708013{col 35}{space 2} .0373481{col 46}{space 5} 8.634806{col 60}{space 3}  8.78122
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. * STEP 7: CONDITIONAL WAGE GAP REGRESSIONS ( FOR ALL-INDIA) 
. 
. display "--- REGRESSIONS FOR YEAR 2018 ---"
{res}--- REGRESSIONS FOR YEAR 2018 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2018
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:10,360}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,327}{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:99,158,044}
{txt}{col 51}{lalign 15:Design df}{col 66} = {res}{ralign 10:4,320}
{txt}{col 51}{lalign 15:F({res:18}, {res:4303})}{col 66} = {res}{ralign 10:101.45}
{txt}{col 51}{lalign 15:Prob > F}{col 66} = {res}{ralign 10:0.0000}
{txt}{col 51}{lalign 15:R-squared}{col 66} = {res}{ralign 10:0.2862}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3535224{col 33}{space 2} .0449988{col 44}{space 1}    7.86{col 53}{space 3}0.000{col 61}{space 4} .2653017{col 74}{space 3} .4417431
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .9289878{col 33}{space 2} .0511647{col 44}{space 1}   18.16{col 53}{space 3}0.000{col 61}{space 4} .8286788{col 74}{space 3} 1.029297
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .4453504{col 33}{space 2} .0466423{col 44}{space 1}    9.55{col 53}{space 3}0.000{col 61}{space 4} .3539076{col 74}{space 3} .5367932
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2355166{col 33}{space 2} .0915611{col 44}{space 1}    2.57{col 53}{space 3}0.010{col 61}{space 4} .0560099{col 74}{space 3} .4150233
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0105157{col 33}{space 2} .0278022{col 44}{space 1}   -0.38{col 53}{space 3}0.705{col 61}{space 4}-.0650223{col 74}{space 3} .0439909
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0125773{col 33}{space 2} .0438829{col 44}{space 1}    0.29{col 53}{space 3}0.774{col 61}{space 4}-.0734557{col 74}{space 3} .0986103
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .3424451{col 33}{space 2} .1218397{col 44}{space 1}    2.81{col 53}{space 3}0.005{col 61}{space 4} .1035768{col 74}{space 3} .5813133
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}-.8862295{col 33}{space 2} .0385392{col 44}{space 1}  -23.00{col 53}{space 3}0.000{col 61}{space 4}-.9617861{col 74}{space 3}-.8106728
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0186645{col 33}{space 2} .0320545{col 44}{space 1}   -0.58{col 53}{space 3}0.560{col 61}{space 4}-.0815078{col 74}{space 3} .0441788
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.0598738{col 33}{space 2} .0503956{col 44}{space 1}   -1.19{col 53}{space 3}0.235{col 61}{space 4}-.1586752{col 74}{space 3} .0389275
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0311406{col 33}{space 2} .0470525{col 44}{space 1}   -0.66{col 53}{space 3}0.508{col 61}{space 4}-.1233877{col 74}{space 3} .0611064
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}  .060974{col 33}{space 2} .0485901{col 44}{space 1}    1.25{col 53}{space 3}0.210{col 61}{space 4}-.0342875{col 74}{space 3} .1562354
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2998911{col 33}{space 2} .0266795{col 44}{space 1}   11.24{col 53}{space 3}0.000{col 61}{space 4} .2475857{col 74}{space 3} .3521966
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2417242{col 33}{space 2}  .067479{col 44}{space 1}    3.58{col 53}{space 3}0.000{col 61}{space 4} .1094308{col 74}{space 3} .3740176
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .1705356{col 33}{space 2}  .120363{col 44}{space 1}    1.42{col 53}{space 3}0.157{col 61}{space 4}-.0654376{col 74}{space 3} .4065088
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0015511{col 33}{space 2}   .00181{col 44}{space 1}   -0.86{col 53}{space 3}0.392{col 61}{space 4}-.0050997{col 74}{space 3} .0019976
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} .0000322{col 33}{space 2} .0000254{col 44}{space 1}    1.27{col 53}{space 3}0.205{col 61}{space 4}-.0000177{col 74}{space 3} .0000821
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.4848216{col 33}{space 2} .0346129{col 44}{space 1}  -14.01{col 53}{space 3}0.000{col 61}{space 4}-.5526807{col 74}{space 3}-.4169626
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.618914{col 33}{space 2} .0761271{col 44}{space 1}  113.22{col 53}{space 3}0.000{col 61}{space 4} 8.469666{col 74}{space 3} 8.768162
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2018
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:40,262}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,336}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:273,216,982}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,330}
{txt}{col 50}{lalign 15:F({res:17}, {res:5314})}{col 65} = {res}{ralign 11:118.99}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3434}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2}  .351146{col 33}{space 2} .0455283{col 44}{space 1}    7.71{col 53}{space 3}0.000{col 61}{space 4} .2618919{col 74}{space 3} .4404001
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} 1.005743{col 33}{space 2} .0488201{col 44}{space 1}   20.60{col 53}{space 3}0.000{col 61}{space 4} .9100351{col 74}{space 3}  1.10145
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .4029782{col 33}{space 2}   .04432{col 44}{space 1}    9.09{col 53}{space 3}0.000{col 61}{space 4}  .316093{col 74}{space 3} .4898635
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2753949{col 33}{space 2} .0413272{col 44}{space 1}    6.66{col 53}{space 3}0.000{col 61}{space 4} .1943766{col 74}{space 3} .3564132
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0747595{col 33}{space 2} .0198631{col 44}{space 1}   -3.76{col 53}{space 3}0.000{col 61}{space 4}-.1136993{col 74}{space 3}-.0358197
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.1027843{col 33}{space 2} .0399336{col 44}{space 1}   -2.57{col 53}{space 3}0.010{col 61}{space 4}-.1810706{col 74}{space 3}-.0244981
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.4642424{col 33}{space 2} .1032599{col 44}{space 1}   -4.50{col 53}{space 3}0.000{col 61}{space 4}-.6666741{col 74}{space 3}-.2618106
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0201346{col 33}{space 2} .0268089{col 44}{space 1}    0.75{col 53}{space 3}0.453{col 61}{space 4}-.0324217{col 74}{space 3}  .072691
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1779457{col 33}{space 2} .0493648{col 44}{space 1}   -3.60{col 53}{space 3}0.000{col 61}{space 4}-.2747209{col 74}{space 3}-.0811704
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.1484039{col 33}{space 2} .0455622{col 44}{space 1}   -3.26{col 53}{space 3}0.001{col 61}{space 4}-.2377245{col 74}{space 3}-.0590834
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}-.0434564{col 33}{space 2} .0461372{col 44}{space 1}   -0.94{col 53}{space 3}0.346{col 61}{space 4}-.1339043{col 74}{space 3} .0469914
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .4246686{col 33}{space 2} .0195384{col 44}{space 1}   21.74{col 53}{space 3}0.000{col 61}{space 4} .3863654{col 74}{space 3} .4629718
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3199169{col 33}{space 2} .0585047{col 44}{space 1}    5.47{col 53}{space 3}0.000{col 61}{space 4} .2052238{col 74}{space 3}   .43461
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2327658{col 33}{space 2}  .064217{col 44}{space 1}    3.62{col 53}{space 3}0.000{col 61}{space 4} .1068743{col 74}{space 3} .3586574
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0001385{col 33}{space 2} .0010897{col 44}{space 1}   -0.13{col 53}{space 3}0.899{col 61}{space 4}-.0022748{col 74}{space 3} .0019977
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 2.42e-06{col 33}{space 2} .0000138{col 44}{space 1}    0.18{col 53}{space 3}0.861{col 61}{space 4}-.0000247{col 74}{space 3} .0000296
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3322935{col 33}{space 2} .0289825{col 44}{space 1}  -11.47{col 53}{space 3}0.000{col 61}{space 4} -.389111{col 74}{space 3} -.275476
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.790645{col 33}{space 2}  .066226{col 44}{space 1}  132.74{col 53}{space 3}0.000{col 61}{space 4} 8.660815{col 74}{space 3} 8.920475
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2018
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:27,743}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,588}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:322,390,077}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,581}
{txt}{col 50}{lalign 15:F({res:18}, {res:6564})}{col 65} = {res}{ralign 11:62.32}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.1613}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .1246342{col 33}{space 2} .0169703{col 44}{space 1}    7.34{col 53}{space 3}0.000{col 61}{space 4} .0913669{col 74}{space 3} .1579015
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .1954365{col 33}{space 2} .0388363{col 44}{space 1}    5.03{col 53}{space 3}0.000{col 61}{space 4} .1193048{col 74}{space 3} .2715682
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .2967885{col 33}{space 2} .0652583{col 44}{space 1}    4.55{col 53}{space 3}0.000{col 61}{space 4} .1688611{col 74}{space 3}  .424716
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3174019{col 33}{space 2} .1370157{col 44}{space 1}    2.32{col 53}{space 3}0.021{col 61}{space 4} .0488066{col 74}{space 3} .5859971
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1186004{col 33}{space 2} .0171498{col 44}{space 1}    6.92{col 53}{space 3}0.000{col 61}{space 4} .0849812{col 74}{space 3} .1522197
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}  .182358{col 33}{space 2}  .025512{col 44}{space 1}    7.15{col 53}{space 3}0.000{col 61}{space 4} .1323462{col 74}{space 3} .2323699
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .1802272{col 33}{space 2} .0892873{col 44}{space 1}    2.02{col 53}{space 3}0.044{col 61}{space 4} .0051952{col 74}{space 3} .3552593
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .7798517{col 33}{space 2} .2464131{col 44}{space 1}    3.16{col 53}{space 3}0.002{col 61}{space 4} .2968022{col 74}{space 3} 1.262901
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0793178{col 33}{space 2} .0259827{col 44}{space 1}   -3.05{col 53}{space 3}0.002{col 61}{space 4}-.1302524{col 74}{space 3}-.0283831
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0943575{col 33}{space 2} .0289172{col 44}{space 1}    3.26{col 53}{space 3}0.001{col 61}{space 4} .0376703{col 74}{space 3} .1510446
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .1932644{col 33}{space 2} .0251173{col 44}{space 1}    7.69{col 53}{space 3}0.000{col 61}{space 4} .1440263{col 74}{space 3} .2425026
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .2859159{col 33}{space 2} .0272548{col 44}{space 1}   10.49{col 53}{space 3}0.000{col 61}{space 4} .2324875{col 74}{space 3} .3393442
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .1471762{col 33}{space 2} .0326909{col 44}{space 1}    4.50{col 53}{space 3}0.000{col 61}{space 4} .0830914{col 74}{space 3}  .211261
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3170063{col 33}{space 2} .0535865{col 44}{space 1}    5.92{col 53}{space 3}0.000{col 61}{space 4} .2119594{col 74}{space 3} .4220532
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .0268635{col 33}{space 2} .1086509{col 44}{space 1}    0.25{col 53}{space 3}0.805{col 61}{space 4}-.1861276{col 74}{space 3} .2398545
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0006435{col 33}{space 2} .0011876{col 44}{space 1}    0.54{col 53}{space 3}0.588{col 61}{space 4}-.0016846{col 74}{space 3} .0029717
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-4.57e-06{col 33}{space 2}  .000016{col 44}{space 1}   -0.28{col 53}{space 3}0.776{col 61}{space 4} -.000036{col 74}{space 3} .0000269
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8261094{col 33}{space 2} .0361966{col 44}{space 1}  -22.82{col 53}{space 3}0.000{col 61}{space 4}-.8970664{col 74}{space 3}-.7551524
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.422871{col 33}{space 2} .0431722{col 44}{space 1}  195.10{col 53}{space 3}0.000{col 61}{space 4} 8.338239{col 74}{space 3} 8.507502
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2018
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:26,543}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,967}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:171,975,197}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,961}
{txt}{col 50}{lalign 15:F({res:18}, {res:4944})}{col 65} = {res}{ralign 11:54.26}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.2801}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .2556828{col 33}{space 2} .0423034{col 44}{space 1}    6.04{col 53}{space 3}0.000{col 61}{space 4} .1727495{col 74}{space 3} .3386161
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .7685659{col 33}{space 2} .0594627{col 44}{space 1}   12.93{col 53}{space 3}0.000{col 61}{space 4} .6519927{col 74}{space 3} .8851391
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3121742{col 33}{space 2} .0674952{col 44}{space 1}    4.63{col 53}{space 3}0.000{col 61}{space 4} .1798538{col 74}{space 3} .4444946
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2822493{col 33}{space 2} .0853613{col 44}{space 1}    3.31{col 53}{space 3}0.001{col 61}{space 4} .1149035{col 74}{space 3} .4495951
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1002488{col 33}{space 2} .0281425{col 44}{space 1}    3.56{col 53}{space 3}0.000{col 61}{space 4} .0450771{col 74}{space 3} .1554206
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .1052603{col 33}{space 2} .0396794{col 44}{space 1}    2.65{col 53}{space 3}0.008{col 61}{space 4} .0274711{col 74}{space 3} .1830494
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}  -.10988{col 33}{space 2}  .138864{col 44}{space 1}   -0.79{col 53}{space 3}0.429{col 61}{space 4}-.3821148{col 74}{space 3} .1623548
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}  .340246{col 33}{space 2} .2398346{col 44}{space 1}    1.42{col 53}{space 3}0.156{col 61}{space 4}-.1299359{col 74}{space 3} .8104278
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.1270412{col 33}{space 2} .0327874{col 44}{space 1}   -3.87{col 53}{space 3}0.000{col 61}{space 4}-.1913189{col 74}{space 3}-.0627634
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.2360287{col 33}{space 2} .0905288{col 44}{space 1}   -2.61{col 53}{space 3}0.009{col 61}{space 4}-.4135052{col 74}{space 3}-.0585521
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0436677{col 33}{space 2} .0869906{col 44}{space 1}   -0.50{col 53}{space 3}0.616{col 61}{space 4}-.2142077{col 74}{space 3} .1268724
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .1182171{col 33}{space 2} .0894691{col 44}{space 1}    1.32{col 53}{space 3}0.186{col 61}{space 4}-.0571819{col 74}{space 3} .2936162
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2599346{col 33}{space 2} .0363166{col 44}{space 1}    7.16{col 53}{space 3}0.000{col 61}{space 4}  .188738{col 74}{space 3} .3311313
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .5622376{col 33}{space 2} .1239262{col 44}{space 1}    4.54{col 53}{space 3}0.000{col 61}{space 4} .3192876{col 74}{space 3} .8051877
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2}-.0055139{col 33}{space 2} .1448978{col 44}{space 1}   -0.04{col 53}{space 3}0.970{col 61}{space 4}-.2895776{col 74}{space 3} .2785497
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0008552{col 33}{space 2} .0014134{col 44}{space 1}    0.61{col 53}{space 3}0.545{col 61}{space 4}-.0019157{col 74}{space 3} .0036262
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-5.25e-06{col 33}{space 2} .0000186{col 44}{space 1}   -0.28{col 53}{space 3}0.777{col 61}{space 4}-.0000417{col 74}{space 3} .0000312
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8447701{col 33}{space 2} .0899603{col 44}{space 1}   -9.39{col 53}{space 3}0.000{col 61}{space 4}-1.021132{col 74}{space 3}-.6684081
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.825223{col 33}{space 2} .1116612{col 44}{space 1}   79.04{col 53}{space 3}0.000{col 61}{space 4} 8.606318{col 74}{space 3} 9.044129
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- REGRESSIONS FOR YEAR 2019 ---"
{res}--- REGRESSIONS FOR YEAR 2019 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2019
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:10,353}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,325}{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:99,103,801}
{txt}{col 51}{lalign 15:Design df}{col 66} = {res}{ralign 10:4,318}
{txt}{col 51}{lalign 15:F({res:18}, {res:4301})}{col 66} = {res}{ralign 10:100.76}
{txt}{col 51}{lalign 15:Prob > F}{col 66} = {res}{ralign 10:0.0000}
{txt}{col 51}{lalign 15:R-squared}{col 66} = {res}{ralign 10:0.2860}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3519474{col 33}{space 2} .0453979{col 44}{space 1}    7.75{col 53}{space 3}0.000{col 61}{space 4} .2629441{col 74}{space 3} .4409506
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .9270107{col 33}{space 2}  .051439{col 44}{space 1}   18.02{col 53}{space 3}0.000{col 61}{space 4} .8261639{col 74}{space 3} 1.027858
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .4475971{col 33}{space 2} .0468008{col 44}{space 1}    9.56{col 53}{space 3}0.000{col 61}{space 4} .3558435{col 74}{space 3} .5393506
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2370267{col 33}{space 2} .0914429{col 44}{space 1}    2.59{col 53}{space 3}0.010{col 61}{space 4} .0577517{col 74}{space 3} .4163018
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} -.010605{col 33}{space 2} .0277081{col 44}{space 1}   -0.38{col 53}{space 3}0.702{col 61}{space 4} -.064927{col 74}{space 3} .0437171
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0142544{col 33}{space 2} .0440408{col 44}{space 1}    0.32{col 53}{space 3}0.746{col 61}{space 4}-.0720882{col 74}{space 3}  .100597
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .3405888{col 33}{space 2} .1218327{col 44}{space 1}    2.80{col 53}{space 3}0.005{col 61}{space 4} .1017341{col 74}{space 3} .5794434
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}-.8609107{col 33}{space 2} .0416325{col 44}{space 1}  -20.68{col 53}{space 3}0.000{col 61}{space 4}-.9425317{col 74}{space 3}-.7792897
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0196749{col 33}{space 2} .0320881{col 44}{space 1}   -0.61{col 53}{space 3}0.540{col 61}{space 4}-.0825841{col 74}{space 3} .0432342
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.0592557{col 33}{space 2} .0503822{col 44}{space 1}   -1.18{col 53}{space 3}0.240{col 61}{space 4}-.1580307{col 74}{space 3} .0395193
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0294929{col 33}{space 2} .0470996{col 44}{space 1}   -0.63{col 53}{space 3}0.531{col 61}{space 4}-.1218323{col 74}{space 3} .0628464
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0638712{col 33}{space 2} .0486458{col 44}{space 1}    1.31{col 53}{space 3}0.189{col 61}{space 4}-.0314994{col 74}{space 3} .1592419
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2999482{col 33}{space 2} .0266211{col 44}{space 1}   11.27{col 53}{space 3}0.000{col 61}{space 4} .2477571{col 74}{space 3} .3521392
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2447766{col 33}{space 2} .0675725{col 44}{space 1}    3.62{col 53}{space 3}0.000{col 61}{space 4} .1122999{col 74}{space 3} .3772534
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .1654704{col 33}{space 2} .1194346{col 44}{space 1}    1.39{col 53}{space 3}0.166{col 61}{space 4}-.0686826{col 74}{space 3} .3996235
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0029573{col 33}{space 2} .0018738{col 44}{space 1}    1.58{col 53}{space 3}0.115{col 61}{space 4}-.0007163{col 74}{space 3} .0066309
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-.0000272{col 33}{space 2} .0000254{col 44}{space 1}   -1.07{col 53}{space 3}0.284{col 61}{space 4} -.000077{col 74}{space 3} .0000225
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.4846377{col 33}{space 2} .0347699{col 44}{space 1}  -13.94{col 53}{space 3}0.000{col 61}{space 4}-.5528045{col 74}{space 3}-.4164709
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.560254{col 33}{space 2} .0750649{col 44}{space 1}  114.04{col 53}{space 3}0.000{col 61}{space 4} 8.413088{col 74}{space 3}  8.70742
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2019
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:38,603}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,310}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:261,599,801}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,304}
{txt}{col 50}{lalign 15:F({res:17}, {res:5288})}{col 65} = {res}{ralign 11:114.34}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3437}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3597231{col 33}{space 2} .0466828{col 44}{space 1}    7.71{col 53}{space 3}0.000{col 61}{space 4} .2682056{col 74}{space 3} .4512405
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} 1.013061{col 33}{space 2} .0498366{col 44}{space 1}   20.33{col 53}{space 3}0.000{col 61}{space 4} .9153607{col 74}{space 3} 1.110761
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .4009188{col 33}{space 2} .0448413{col 44}{space 1}    8.94{col 53}{space 3}0.000{col 61}{space 4} .3130113{col 74}{space 3} .4888262
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2795905{col 33}{space 2} .0414571{col 44}{space 1}    6.74{col 53}{space 3}0.000{col 61}{space 4} .1983175{col 74}{space 3} .3608635
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0807981{col 33}{space 2} .0201181{col 44}{space 1}   -4.02{col 53}{space 3}0.000{col 61}{space 4}-.1202379{col 74}{space 3}-.0413584
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} -.110125{col 33}{space 2} .0403238{col 44}{space 1}   -2.73{col 53}{space 3}0.006{col 61}{space 4}-.1891763{col 74}{space 3}-.0310737
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} -.462475{col 33}{space 2} .1079387{col 44}{space 1}   -4.28{col 53}{space 3}0.000{col 61}{space 4}-.6740793{col 74}{space 3}-.2508706
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0191835{col 33}{space 2} .0275168{col 44}{space 1}    0.70{col 53}{space 3}0.486{col 61}{space 4}-.0347607{col 74}{space 3} .0731278
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1774402{col 33}{space 2} .0506349{col 44}{space 1}   -3.50{col 53}{space 3}0.000{col 61}{space 4}-.2767055{col 74}{space 3}-.0781749
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.1528541{col 33}{space 2}  .046475{col 44}{space 1}   -3.29{col 53}{space 3}0.001{col 61}{space 4}-.2439641{col 74}{space 3} -.061744
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}-.0487089{col 33}{space 2} .0473222{col 44}{space 1}   -1.03{col 53}{space 3}0.303{col 61}{space 4}-.1414798{col 74}{space 3} .0440619
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .4228731{col 33}{space 2} .0198338{col 44}{space 1}   21.32{col 53}{space 3}0.000{col 61}{space 4} .3839907{col 74}{space 3} .4617555
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3222962{col 33}{space 2} .0593732{col 44}{space 1}    5.43{col 53}{space 3}0.000{col 61}{space 4} .2059002{col 74}{space 3} .4386922
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2104306{col 33}{space 2} .0643436{col 44}{space 1}    3.27{col 53}{space 3}0.001{col 61}{space 4} .0842906{col 74}{space 3} .3365705
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0009275{col 33}{space 2} .0011932{col 44}{space 1}    0.78{col 53}{space 3}0.437{col 61}{space 4}-.0014117{col 74}{space 3} .0032668
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-.0000166{col 33}{space 2} .0000151{col 44}{space 1}   -1.10{col 53}{space 3}0.271{col 61}{space 4}-.0000461{col 74}{space 3}  .000013
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3284918{col 33}{space 2} .0297019{col 44}{space 1}  -11.06{col 53}{space 3}0.000{col 61}{space 4}-.3867198{col 74}{space 3}-.2702639
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.785903{col 33}{space 2}  .068721{col 44}{space 1}  127.85{col 53}{space 3}0.000{col 61}{space 4} 8.651181{col 74}{space 3} 8.920624
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2019
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:27,716}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,588}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:322,109,006}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,581}
{txt}{col 50}{lalign 15:F({res:18}, {res:6564})}{col 65} = {res}{ralign 11:62.28}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.1614}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .1239261{col 33}{space 2}  .016993{col 44}{space 1}    7.29{col 53}{space 3}0.000{col 61}{space 4} .0906143{col 74}{space 3} .1572378
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .1942633{col 33}{space 2} .0387662{col 44}{space 1}    5.01{col 53}{space 3}0.000{col 61}{space 4} .1182689{col 74}{space 3} .2702576
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .2955495{col 33}{space 2} .0649096{col 44}{space 1}    4.55{col 53}{space 3}0.000{col 61}{space 4} .1683057{col 74}{space 3} .4227933
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3201006{col 33}{space 2}  .137068{col 44}{space 1}    2.34{col 53}{space 3}0.020{col 61}{space 4}  .051403{col 74}{space 3} .5887983
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1182084{col 33}{space 2}   .01724{col 44}{space 1}    6.86{col 53}{space 3}0.000{col 61}{space 4} .0844124{col 74}{space 3} .1520043
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .1809547{col 33}{space 2} .0254975{col 44}{space 1}    7.10{col 53}{space 3}0.000{col 61}{space 4} .1309714{col 74}{space 3}  .230938
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .1783832{col 33}{space 2} .0894501{col 44}{space 1}    1.99{col 53}{space 3}0.046{col 61}{space 4}  .003032{col 74}{space 3} .3537345
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .7787818{col 33}{space 2} .2447155{col 44}{space 1}    3.18{col 53}{space 3}0.001{col 61}{space 4} .2990599{col 74}{space 3} 1.258504
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0791581{col 33}{space 2} .0259459{col 44}{space 1}   -3.05{col 53}{space 3}0.002{col 61}{space 4}-.1300204{col 74}{space 3}-.0282958
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0948185{col 33}{space 2} .0289374{col 44}{space 1}    3.28{col 53}{space 3}0.001{col 61}{space 4} .0380919{col 74}{space 3} .1515451
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .1938164{col 33}{space 2} .0251272{col 44}{space 1}    7.71{col 53}{space 3}0.000{col 61}{space 4} .1445589{col 74}{space 3} .2430738
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}  .286725{col 33}{space 2} .0272763{col 44}{space 1}   10.51{col 53}{space 3}0.000{col 61}{space 4} .2332545{col 74}{space 3} .3401954
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .1467966{col 33}{space 2} .0326594{col 44}{space 1}    4.49{col 53}{space 3}0.000{col 61}{space 4} .0827736{col 74}{space 3} .2108197
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3167152{col 33}{space 2} .0536588{col 44}{space 1}    5.90{col 53}{space 3}0.000{col 61}{space 4} .2115266{col 74}{space 3} .4219038
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .0292521{col 33}{space 2} .1087773{col 44}{space 1}    0.27{col 53}{space 3}0.788{col 61}{space 4}-.1839868{col 74}{space 3}  .242491
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0007995{col 33}{space 2} .0010821{col 44}{space 1}    0.74{col 53}{space 3}0.460{col 61}{space 4}-.0013218{col 74}{space 3} .0029207
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-5.73e-06{col 33}{space 2} .0000148{col 44}{space 1}   -0.39{col 53}{space 3}0.698{col 61}{space 4}-.0000347{col 74}{space 3} .0000233
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8258563{col 33}{space 2} .0362394{col 44}{space 1}  -22.79{col 53}{space 3}0.000{col 61}{space 4}-.8968974{col 74}{space 3}-.7548153
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.420326{col 33}{space 2} .0426197{col 44}{space 1}  197.57{col 53}{space 3}0.000{col 61}{space 4} 8.336778{col 74}{space 3} 8.503875
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2019
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:25,447}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,931}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:164,847,878}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,925}
{txt}{col 50}{lalign 15:F({res:18}, {res:4908})}{col 65} = {res}{ralign 11:52.93}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.2766}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2}  .259263{col 33}{space 2} .0433697{col 44}{space 1}    5.98{col 53}{space 3}0.000{col 61}{space 4} .1742391{col 74}{space 3} .3442869
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .7649172{col 33}{space 2} .0612287{col 44}{space 1}   12.49{col 53}{space 3}0.000{col 61}{space 4} .6448816{col 74}{space 3} .8849528
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3203662{col 33}{space 2} .0676899{col 44}{space 1}    4.73{col 53}{space 3}0.000{col 61}{space 4} .1876638{col 74}{space 3} .4530686
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2943431{col 33}{space 2} .0889108{col 44}{space 1}    3.31{col 53}{space 3}0.001{col 61}{space 4} .1200382{col 74}{space 3}  .468648
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0990965{col 33}{space 2} .0284212{col 44}{space 1}    3.49{col 53}{space 3}0.000{col 61}{space 4} .0433784{col 74}{space 3} .1548147
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0980063{col 33}{space 2} .0409572{col 44}{space 1}    2.39{col 53}{space 3}0.017{col 61}{space 4} .0177119{col 74}{space 3} .1783007
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} -.112922{col 33}{space 2} .1403211{col 44}{space 1}   -0.80{col 53}{space 3}0.421{col 61}{space 4}-.3880139{col 74}{space 3}   .16217
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .3429665{col 33}{space 2} .2407283{col 44}{space 1}    1.42{col 53}{space 3}0.154{col 61}{space 4}-.1289684{col 74}{space 3} .8149013
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.1256015{col 33}{space 2} .0332689{col 44}{space 1}   -3.78{col 53}{space 3}0.000{col 61}{space 4}-.1908234{col 74}{space 3}-.0603797
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.2268125{col 33}{space 2} .0976097{col 44}{space 1}   -2.32{col 53}{space 3}0.020{col 61}{space 4} -.418171{col 74}{space 3}-.0354539
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0363053{col 33}{space 2} .0940963{col 44}{space 1}   -0.39{col 53}{space 3}0.700{col 61}{space 4}-.2207759{col 74}{space 3} .1481653
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .1238541{col 33}{space 2} .0964914{col 44}{space 1}    1.28{col 53}{space 3}0.199{col 61}{space 4}-.0653121{col 74}{space 3} .3130204
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2583954{col 33}{space 2} .0373539{col 44}{space 1}    6.92{col 53}{space 3}0.000{col 61}{space 4} .1851651{col 74}{space 3} .3316257
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .5554869{col 33}{space 2} .1302749{col 44}{space 1}    4.26{col 53}{space 3}0.000{col 61}{space 4} .3000899{col 74}{space 3} .8108838
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} -.022926{col 33}{space 2} .1406817{col 44}{space 1}   -0.16{col 53}{space 3}0.871{col 61}{space 4}-.2987249{col 74}{space 3} .2528729
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} -.000201{col 33}{space 2}  .001634{col 44}{space 1}   -0.12{col 53}{space 3}0.902{col 61}{space 4}-.0034043{col 74}{space 3} .0030023
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-8.59e-06{col 33}{space 2} .0000201{col 44}{space 1}   -0.43{col 53}{space 3}0.669{col 61}{space 4} -.000048{col 74}{space 3} .0000308
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8459025{col 33}{space 2} .0928919{col 44}{space 1}   -9.11{col 53}{space 3}0.000{col 61}{space 4}-1.028012{col 74}{space 3}-.6637931
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}  8.85746{col 33}{space 2} .1205537{col 44}{space 1}   73.47{col 53}{space 3}0.000{col 61}{space 4} 8.621121{col 74}{space 3} 9.093799
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- REGRESSIONS FOR YEAR 2020 ---"
{res}--- REGRESSIONS FOR YEAR 2020 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2020
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:9,438}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,046}{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:93,221,246}
{txt}{col 51}{lalign 15:Design df}{col 66} = {res}{ralign 10:4,039}
{txt}{col 51}{lalign 15:F({res:17}, {res:4023})}{col 66} = {res}{ralign 10:54.98}
{txt}{col 51}{lalign 15:Prob > F}{col 66} = {res}{ralign 10:0.0000}
{txt}{col 51}{lalign 15:R-squared}{col 66} = {res}{ralign 10:0.2437}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3767557{col 33}{space 2} .0491323{col 44}{space 1}    7.67{col 53}{space 3}0.000{col 61}{space 4} .2804292{col 74}{space 3} .4730821
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .9114208{col 33}{space 2} .0569614{col 44}{space 1}   16.00{col 53}{space 3}0.000{col 61}{space 4} .7997451{col 74}{space 3} 1.023096
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3035308{col 33}{space 2} .0579692{col 44}{space 1}    5.24{col 53}{space 3}0.000{col 61}{space 4} .1898793{col 74}{space 3} .4171824
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2267464{col 33}{space 2} .0684382{col 44}{space 1}    3.31{col 53}{space 3}0.001{col 61}{space 4} .0925698{col 74}{space 3}  .360923
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0176762{col 33}{space 2} .0313438{col 44}{space 1}    0.56{col 53}{space 3}0.573{col 61}{space 4} -.043775{col 74}{space 3} .0791273
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0575715{col 33}{space 2} .0492422{col 44}{space 1}    1.17{col 53}{space 3}0.242{col 61}{space 4}-.0389704{col 74}{space 3} .1541133
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .0818678{col 33}{space 2}  .088005{col 44}{space 1}    0.93{col 53}{space 3}0.352{col 61}{space 4}-.0906706{col 74}{space 3} .2544062
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0306247{col 33}{space 2} .0264375{col 44}{space 1}   -1.16{col 53}{space 3}0.247{col 61}{space 4}-.0824568{col 74}{space 3} .0212075
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1015901{col 33}{space 2} .0446534{col 44}{space 1}   -2.28{col 53}{space 3}0.023{col 61}{space 4}-.1891355{col 74}{space 3}-.0140448
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0811705{col 33}{space 2}  .040559{col 44}{space 1}   -2.00{col 53}{space 3}0.045{col 61}{space 4}-.1606885{col 74}{space 3}-.0016525
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0608118{col 33}{space 2} .0428896{col 44}{space 1}    1.42{col 53}{space 3}0.156{col 61}{space 4}-.0232754{col 74}{space 3}  .144899
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3649824{col 33}{space 2} .0278739{col 44}{space 1}   13.09{col 53}{space 3}0.000{col 61}{space 4} .3103341{col 74}{space 3} .4196307
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3470123{col 33}{space 2} .0620145{col 44}{space 1}    5.60{col 53}{space 3}0.000{col 61}{space 4} .2254298{col 74}{space 3} .4685949
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .3294975{col 33}{space 2} .1227972{col 44}{space 1}    2.68{col 53}{space 3}0.007{col 61}{space 4} .0887472{col 74}{space 3} .5702478
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0008392{col 33}{space 2} .0022468{col 44}{space 1}    0.37{col 53}{space 3}0.709{col 61}{space 4}-.0035658{col 74}{space 3} .0052442
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-1.54e-06{col 33}{space 2} .0000287{col 44}{space 1}   -0.05{col 53}{space 3}0.957{col 61}{space 4}-.0000579{col 74}{space 3} .0000548
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.4057835{col 33}{space 2} .0313029{col 44}{space 1}  -12.96{col 53}{space 3}0.000{col 61}{space 4}-.4671545{col 74}{space 3}-.3444126
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.579966{col 33}{space 2} .0803267{col 44}{space 1}  106.81{col 53}{space 3}0.000{col 61}{space 4} 8.422481{col 74}{space 3} 8.737451
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2020
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:66,166}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,127}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:514,340,142}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,121}
{txt}{col 50}{lalign 15:F({res:17}, {res:5105})}{col 65} = {res}{ralign 11:148.40}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3623}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2}  .406392{col 33}{space 2} .0379643{col 44}{space 1}   10.70{col 53}{space 3}0.000{col 61}{space 4} .3319658{col 74}{space 3} .4808182
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} 1.087634{col 33}{space 2} .0425025{col 44}{space 1}   25.59{col 53}{space 3}0.000{col 61}{space 4} 1.004311{col 74}{space 3} 1.170957
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .4535492{col 33}{space 2}  .038925{col 44}{space 1}   11.65{col 53}{space 3}0.000{col 61}{space 4} .3772395{col 74}{space 3} .5298589
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4153115{col 33}{space 2} .0415265{col 44}{space 1}   10.00{col 53}{space 3}0.000{col 61}{space 4} .3339019{col 74}{space 3} .4967212
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0302355{col 33}{space 2} .0206349{col 44}{space 1}   -1.47{col 53}{space 3}0.143{col 61}{space 4}-.0706888{col 74}{space 3} .0102177
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.1877473{col 33}{space 2} .0438053{col 44}{space 1}   -4.29{col 53}{space 3}0.000{col 61}{space 4}-.2736245{col 74}{space 3}-.1018702
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.4634443{col 33}{space 2} .1691164{col 44}{space 1}   -2.74{col 53}{space 3}0.006{col 61}{space 4}-.7949846{col 74}{space 3}-.1319039
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0224916{col 33}{space 2} .0229361{col 44}{space 1}    0.98{col 53}{space 3}0.327{col 61}{space 4}-.0224729{col 74}{space 3} .0674562
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}  -.09891{col 33}{space 2} .0748264{col 44}{space 1}   -1.32{col 53}{space 3}0.186{col 61}{space 4}-.2456017{col 74}{space 3} .0477816
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0708904{col 33}{space 2} .0717265{col 44}{space 1}   -0.99{col 53}{space 3}0.323{col 61}{space 4}-.2115049{col 74}{space 3} .0697241
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0687843{col 33}{space 2} .0702412{col 44}{space 1}    0.98{col 53}{space 3}0.327{col 61}{space 4}-.0689185{col 74}{space 3}  .206487
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3751693{col 33}{space 2} .0232456{col 44}{space 1}   16.14{col 53}{space 3}0.000{col 61}{space 4}  .329598{col 74}{space 3} .4207407
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3114267{col 33}{space 2} .0606785{col 44}{space 1}    5.13{col 53}{space 3}0.000{col 61}{space 4} .1924709{col 74}{space 3} .4303825
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2183423{col 33}{space 2} .0847848{col 44}{space 1}    2.58{col 53}{space 3}0.010{col 61}{space 4} .0521278{col 74}{space 3} .3845568
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0000914{col 33}{space 2} .0007947{col 44}{space 1}   -0.12{col 53}{space 3}0.908{col 61}{space 4}-.0016493{col 74}{space 3} .0014664
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-1.77e-06{col 33}{space 2} .0000112{col 44}{space 1}   -0.16{col 53}{space 3}0.874{col 61}{space 4}-.0000237{col 74}{space 3} .0000201
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3723822{col 33}{space 2} .0268911{col 44}{space 1}  -13.85{col 53}{space 3}0.000{col 61}{space 4}-.4251002{col 74}{space 3}-.3196642
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.743163{col 33}{space 2} .0854457{col 44}{space 1}  102.32{col 53}{space 3}0.000{col 61}{space 4} 8.575653{col 74}{space 3} 8.910673
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2020
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:26,270}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,389}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:324,455,741}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,382}
{txt}{col 50}{lalign 15:F({res:17}, {res:6366})}{col 65} = {res}{ralign 11:82.72}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.1775}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .0545015{col 33}{space 2} .0169231{col 44}{space 1}    3.22{col 53}{space 3}0.001{col 61}{space 4} .0213265{col 74}{space 3} .0876765
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .1436572{col 33}{space 2} .0295716{col 44}{space 1}    4.86{col 53}{space 3}0.000{col 61}{space 4} .0856869{col 74}{space 3} .2016274
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .0343874{col 33}{space 2} .0631075{col 44}{space 1}    0.54{col 53}{space 3}0.586{col 61}{space 4}-.0893245{col 74}{space 3} .1580993
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2}   .29016{col 33}{space 2} .0959605{col 44}{space 1}    3.02{col 53}{space 3}0.003{col 61}{space 4} .1020452{col 74}{space 3} .4782748
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1274696{col 33}{space 2} .0164318{col 44}{space 1}    7.76{col 53}{space 3}0.000{col 61}{space 4} .0952577{col 74}{space 3} .1596815
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .1861193{col 33}{space 2} .0248038{col 44}{space 1}    7.50{col 53}{space 3}0.000{col 61}{space 4} .1374956{col 74}{space 3}  .234743
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .3161941{col 33}{space 2} .0723769{col 44}{space 1}    4.37{col 53}{space 3}0.000{col 61}{space 4}  .174311{col 74}{space 3} .4580772
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0190689{col 33}{space 2} .0182032{col 44}{space 1}   -1.05{col 53}{space 3}0.295{col 61}{space 4}-.0547532{col 74}{space 3} .0166154
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0824238{col 33}{space 2} .0301108{col 44}{space 1}    2.74{col 53}{space 3}0.006{col 61}{space 4} .0233966{col 74}{space 3}  .141451
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .2001194{col 33}{space 2} .0256432{col 44}{space 1}    7.80{col 53}{space 3}0.000{col 61}{space 4} .1498501{col 74}{space 3} .2503887
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .2987101{col 33}{space 2} .0297629{col 44}{space 1}   10.04{col 53}{space 3}0.000{col 61}{space 4} .2403649{col 74}{space 3} .3570553
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2}   .15669{col 33}{space 2} .0252986{col 44}{space 1}    6.19{col 53}{space 3}0.000{col 61}{space 4} .1070963{col 74}{space 3} .2062838
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3093754{col 33}{space 2} .0468611{col 44}{space 1}    6.60{col 53}{space 3}0.000{col 61}{space 4}  .217512{col 74}{space 3} .4012388
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .0859139{col 33}{space 2} .1320913{col 44}{space 1}    0.65{col 53}{space 3}0.515{col 61}{space 4}-.1730295{col 74}{space 3} .3448573
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0001173{col 33}{space 2} .0011676{col 44}{space 1}   -0.10{col 53}{space 3}0.920{col 61}{space 4}-.0024062{col 74}{space 3} .0021716
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 7.31e-06{col 33}{space 2} .0000154{col 44}{space 1}    0.48{col 53}{space 3}0.634{col 61}{space 4}-.0000228{col 74}{space 3} .0000374
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8005956{col 33}{space 2} .0258953{col 44}{space 1}  -30.92{col 53}{space 3}0.000{col 61}{space 4}-.8513591{col 74}{space 3} -.749832
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.549122{col 33}{space 2} .0428384{col 44}{space 1}  199.57{col 53}{space 3}0.000{col 61}{space 4} 8.465145{col 74}{space 3}   8.6331
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2020
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:38,091}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,606}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:263,787,530}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,600}
{txt}{col 50}{lalign 15:F({res:17}, {res:4584})}{col 65} = {res}{ralign 11:45.49}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.2784}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .2314796{col 33}{space 2} .0493199{col 44}{space 1}    4.69{col 53}{space 3}0.000{col 61}{space 4}  .134789{col 74}{space 3} .3281702
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .7357219{col 33}{space 2} .0612692{col 44}{space 1}   12.01{col 53}{space 3}0.000{col 61}{space 4} .6156049{col 74}{space 3} .8558388
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3572415{col 33}{space 2} .1049573{col 44}{space 1}    3.40{col 53}{space 3}0.001{col 61}{space 4} .1514748{col 74}{space 3} .5630083
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2816833{col 33}{space 2}  .078722{col 44}{space 1}    3.58{col 53}{space 3}0.000{col 61}{space 4} .1273504{col 74}{space 3} .4360163
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}   .07844{col 33}{space 2} .0292678{col 44}{space 1}    2.68{col 53}{space 3}0.007{col 61}{space 4} .0210611{col 74}{space 3} .1358189
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.0441213{col 33}{space 2} .0638622{col 44}{space 1}   -0.69{col 53}{space 3}0.490{col 61}{space 4}-.1693219{col 74}{space 3} .0810792
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .0251131{col 33}{space 2} .1014323{col 44}{space 1}    0.25{col 53}{space 3}0.804{col 61}{space 4}-.1737429{col 74}{space 3}  .223969
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0185816{col 33}{space 2} .0345611{col 44}{space 1}    0.54{col 53}{space 3}0.591{col 61}{space 4}-.0491748{col 74}{space 3}  .086338
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1645198{col 33}{space 2} .0935701{col 44}{space 1}   -1.76{col 53}{space 3}0.079{col 61}{space 4}-.3479621{col 74}{space 3} .0189226
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.1443673{col 33}{space 2}  .084486{col 44}{space 1}   -1.71{col 53}{space 3}0.088{col 61}{space 4}-.3100004{col 74}{space 3} .0212657
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0485504{col 33}{space 2} .0860401{col 44}{space 1}    0.56{col 53}{space 3}0.573{col 61}{space 4}-.1201295{col 74}{space 3} .2172303
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2789527{col 33}{space 2} .0403365{col 44}{space 1}    6.92{col 53}{space 3}0.000{col 61}{space 4} .1998738{col 74}{space 3} .3580317
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .5360407{col 33}{space 2} .0867362{col 44}{space 1}    6.18{col 53}{space 3}0.000{col 61}{space 4} .3659961{col 74}{space 3} .7060852
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .4674707{col 33}{space 2}  .120833{col 44}{space 1}    3.87{col 53}{space 3}0.000{col 61}{space 4}   .23058{col 74}{space 3} .7043614
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0004007{col 33}{space 2} .0011762{col 44}{space 1}    0.34{col 53}{space 3}0.733{col 61}{space 4}-.0019053{col 74}{space 3} .0027066
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-8.77e-06{col 33}{space 2} .0000158{col 44}{space 1}   -0.56{col 53}{space 3}0.578{col 61}{space 4}-.0000397{col 74}{space 3} .0000222
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.9606881{col 33}{space 2} .0602721{col 44}{space 1}  -15.94{col 53}{space 3}0.000{col 61}{space 4} -1.07885{col 74}{space 3}-.8425259
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.985845{col 33}{space 2} .1079651{col 44}{space 1}   83.23{col 53}{space 3}0.000{col 61}{space 4} 8.774181{col 74}{space 3} 9.197508
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- REGRESSIONS FOR YEAR 2022 ---"
{res}--- REGRESSIONS FOR YEAR 2022 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2022
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:9,017}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:3,822}{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:97,218,429}
{txt}{col 51}{lalign 15:Design df}{col 66} = {res}{ralign 10:3,815}
{txt}{col 51}{lalign 15:F({res:17}, {res:3799})}{col 66} = {res}{ralign 10:59.85}
{txt}{col 51}{lalign 15:Prob > F}{col 66} = {res}{ralign 10:0.0000}
{txt}{col 51}{lalign 15:R-squared}{col 66} = {res}{ralign 10:0.3263}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .4733419{col 33}{space 2} .0690021{col 44}{space 1}    6.86{col 53}{space 3}0.000{col 61}{space 4} .3380574{col 74}{space 3} .6086263
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} 1.065124{col 33}{space 2} .0749227{col 44}{space 1}   14.22{col 53}{space 3}0.000{col 61}{space 4} .9182319{col 74}{space 3} 1.212017
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3993254{col 33}{space 2} .0456665{col 44}{space 1}    8.74{col 53}{space 3}0.000{col 61}{space 4} .3097923{col 74}{space 3} .4888585
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4039453{col 33}{space 2} .0875091{col 44}{space 1}    4.62{col 53}{space 3}0.000{col 61}{space 4} .2323762{col 74}{space 3} .5755145
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0648486{col 33}{space 2} .0346912{col 44}{space 1}    1.87{col 53}{space 3}0.062{col 61}{space 4}-.0031665{col 74}{space 3} .1328637
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0482153{col 33}{space 2} .0458248{col 44}{space 1}    1.05{col 53}{space 3}0.293{col 61}{space 4}-.0416282{col 74}{space 3} .1380587
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.1826828{col 33}{space 2} .1518791{col 44}{space 1}   -1.20{col 53}{space 3}0.229{col 61}{space 4}-.4804548{col 74}{space 3} .1150892
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0292139{col 33}{space 2} .0292899{col 44}{space 1}    1.00{col 53}{space 3}0.319{col 61}{space 4}-.0282114{col 74}{space 3} .0866392
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.0246116{col 33}{space 2} .0576839{col 44}{space 1}   -0.43{col 53}{space 3}0.670{col 61}{space 4}-.1377058{col 74}{space 3} .0884826
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0551167{col 33}{space 2} .0581114{col 44}{space 1}   -0.95{col 53}{space 3}0.343{col 61}{space 4}-.1690491{col 74}{space 3} .0588156
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}-.0024338{col 33}{space 2} .0599485{col 44}{space 1}   -0.04{col 53}{space 3}0.968{col 61}{space 4} -.119968{col 74}{space 3} .1151003
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3723619{col 33}{space 2} .0303333{col 44}{space 1}   12.28{col 53}{space 3}0.000{col 61}{space 4}  .312891{col 74}{space 3} .4318329
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3866716{col 33}{space 2} .0816836{col 44}{space 1}    4.73{col 53}{space 3}0.000{col 61}{space 4} .2265239{col 74}{space 3} .5468193
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .1413028{col 33}{space 2} .1541227{col 44}{space 1}    0.92{col 53}{space 3}0.359{col 61}{space 4}-.1608681{col 74}{space 3} .4434736
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0017621{col 33}{space 2} .0026964{col 44}{space 1}    0.65{col 53}{space 3}0.513{col 61}{space 4}-.0035243{col 74}{space 3} .0070486
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-.0000438{col 33}{space 2} .0000388{col 44}{space 1}   -1.13{col 53}{space 3}0.259{col 61}{space 4}-.0001199{col 74}{space 3} .0000322
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.5120976{col 33}{space 2} .0426413{col 44}{space 1}  -12.01{col 53}{space 3}0.000{col 61}{space 4}-.5956995{col 74}{space 3}-.4284957
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.519597{col 33}{space 2} .0951636{col 44}{space 1}   89.53{col 53}{space 3}0.000{col 61}{space 4}  8.33302{col 74}{space 3} 8.706173
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2022
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:59,164}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,174}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:440,633,288}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,168}
{txt}{col 50}{lalign 15:F({res:17}, {res:5152})}{col 65} = {res}{ralign 11:145.72}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3525}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3185941{col 33}{space 2} .0405689{col 44}{space 1}    7.85{col 53}{space 3}0.000{col 61}{space 4} .2390619{col 74}{space 3} .3981262
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2}  1.00344{col 33}{space 2} .0434159{col 44}{space 1}   23.11{col 53}{space 3}0.000{col 61}{space 4} .9183263{col 74}{space 3} 1.088553
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3923262{col 33}{space 2} .0317191{col 44}{space 1}   12.37{col 53}{space 3}0.000{col 61}{space 4} .3301433{col 74}{space 3}  .454509
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3658967{col 33}{space 2} .0412042{col 44}{space 1}    8.88{col 53}{space 3}0.000{col 61}{space 4} .2851191{col 74}{space 3} .4466743
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0710901{col 33}{space 2} .0202026{col 44}{space 1}   -3.52{col 53}{space 3}0.000{col 61}{space 4}-.1106958{col 74}{space 3}-.0314844
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.2083363{col 33}{space 2} .0413581{col 44}{space 1}   -5.04{col 53}{space 3}0.000{col 61}{space 4}-.2894156{col 74}{space 3} -.127257
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} -.217835{col 33}{space 2} .1390036{col 44}{space 1}   -1.57{col 53}{space 3}0.117{col 61}{space 4}-.4903409{col 74}{space 3} .0546709
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} -.002245{col 33}{space 2}  .023794{col 44}{space 1}   -0.09{col 53}{space 3}0.925{col 61}{space 4}-.0488913{col 74}{space 3} .0444013
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.2217455{col 33}{space 2}  .057244{col 44}{space 1}   -3.87{col 53}{space 3}0.000{col 61}{space 4} -.333968{col 74}{space 3} -.109523
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.1375029{col 33}{space 2} .0544157{col 44}{space 1}   -2.53{col 53}{space 3}0.012{col 61}{space 4}-.2441807{col 74}{space 3}-.0308252
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}-.0079441{col 33}{space 2} .0543057{col 44}{space 1}   -0.15{col 53}{space 3}0.884{col 61}{space 4}-.1144062{col 74}{space 3} .0985181
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3363156{col 33}{space 2} .0203849{col 44}{space 1}   16.50{col 53}{space 3}0.000{col 61}{space 4} .2963526{col 74}{space 3} .3762786
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2205152{col 33}{space 2}    .0582{col 44}{space 1}    3.79{col 53}{space 3}0.000{col 61}{space 4} .1064186{col 74}{space 3} .3346117
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2}  .079747{col 33}{space 2} .0951831{col 44}{space 1}    0.84{col 53}{space 3}0.402{col 61}{space 4}-.1068521{col 74}{space 3}  .266346
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0017177{col 33}{space 2} .0006601{col 44}{space 1}    2.60{col 53}{space 3}0.009{col 61}{space 4} .0004236{col 74}{space 3} .0030118
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-.0000217{col 33}{space 2} 8.92e-06{col 44}{space 1}   -2.43{col 53}{space 3}0.015{col 61}{space 4}-.0000392{col 74}{space 3}-4.20e-06
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3440398{col 33}{space 2} .0292377{col 44}{space 1}  -11.77{col 53}{space 3}0.000{col 61}{space 4} -.401358{col 74}{space 3}-.2867216
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.986579{col 33}{space 2}  .068261{col 44}{space 1}  131.65{col 53}{space 3}0.000{col 61}{space 4} 8.852759{col 74}{space 3}   9.1204
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2022
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:7}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:26,856}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,410}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:339,621,618}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,403}
{txt}{col 50}{lalign 15:F({res:18}, {res:6386})}{col 65} = {res}{ralign 11:99.50}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.2182}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .1314675{col 33}{space 2} .0180049{col 44}{space 1}    7.30{col 53}{space 3}0.000{col 61}{space 4} .0961718{col 74}{space 3} .1667632
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2223427{col 33}{space 2} .0322861{col 44}{space 1}    6.89{col 53}{space 3}0.000{col 61}{space 4} .1590512{col 74}{space 3} .2856341
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .2101391{col 33}{space 2} .0522909{col 44}{space 1}    4.02{col 53}{space 3}0.000{col 61}{space 4} .1076315{col 74}{space 3} .3126467
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4158649{col 33}{space 2}  .140006{col 44}{space 1}    2.97{col 53}{space 3}0.003{col 61}{space 4} .1414063{col 74}{space 3} .6903235
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1349571{col 33}{space 2} .0153917{col 44}{space 1}    8.77{col 53}{space 3}0.000{col 61}{space 4} .1047842{col 74}{space 3}   .16513
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .1347294{col 33}{space 2} .0284195{col 44}{space 1}    4.74{col 53}{space 3}0.000{col 61}{space 4} .0790177{col 74}{space 3} .1904411
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .2657214{col 33}{space 2} .0722785{col 44}{space 1}    3.68{col 53}{space 3}0.000{col 61}{space 4} .1240313{col 74}{space 3} .4074114
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .6501472{col 33}{space 2} .5101514{col 44}{space 1}    1.27{col 53}{space 3}0.203{col 61}{space 4}-.3499203{col 74}{space 3} 1.650215
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0851131{col 33}{space 2} .0192987{col 44}{space 1}   -4.41{col 53}{space 3}0.000{col 61}{space 4} -.122945{col 74}{space 3}-.0472813
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0959387{col 33}{space 2}   .03007{col 44}{space 1}    3.19{col 53}{space 3}0.001{col 61}{space 4} .0369914{col 74}{space 3}  .154886
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .1930301{col 33}{space 2} .0275875{col 44}{space 1}    7.00{col 53}{space 3}0.000{col 61}{space 4} .1389494{col 74}{space 3} .2471108
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .2892093{col 33}{space 2} .0297529{col 44}{space 1}    9.72{col 53}{space 3}0.000{col 61}{space 4} .2308838{col 74}{space 3} .3475349
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .1592135{col 33}{space 2} .0253763{col 44}{space 1}    6.27{col 53}{space 3}0.000{col 61}{space 4} .1094676{col 74}{space 3} .2089595
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2}  .344388{col 33}{space 2} .0476641{col 44}{space 1}    7.23{col 53}{space 3}0.000{col 61}{space 4} .2509505{col 74}{space 3} .4378254
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2054923{col 33}{space 2} .0874438{col 44}{space 1}    2.35{col 53}{space 3}0.019{col 61}{space 4} .0340733{col 74}{space 3} .3769114
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0000447{col 33}{space 2} .0012412{col 44}{space 1}   -0.04{col 53}{space 3}0.971{col 61}{space 4}-.0024779{col 74}{space 3} .0023884
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 6.80e-06{col 33}{space 2} .0000158{col 44}{space 1}    0.43{col 53}{space 3}0.667{col 61}{space 4}-.0000242{col 74}{space 3} .0000378
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.8626322{col 33}{space 2} .0254873{col 44}{space 1}  -33.85{col 53}{space 3}0.000{col 61}{space 4}-.9125959{col 74}{space 3}-.8126686
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.564943{col 33}{space 2} .0447273{col 44}{space 1}  191.49{col 53}{space 3}0.000{col 61}{space 4} 8.477263{col 74}{space 3} 8.652624
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2022
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:36,671}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,851}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:250,742,372}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,845}
{txt}{col 50}{lalign 15:F({res:18}, {res:4828})}{col 65} = {res}{ralign 11:37.84}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.2921}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .1697011{col 33}{space 2} .0468231{col 44}{space 1}    3.62{col 53}{space 3}0.000{col 61}{space 4} .0779066{col 74}{space 3} .2614956
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4977299{col 33}{space 2} .0595801{col 44}{space 1}    8.35{col 53}{space 3}0.000{col 61}{space 4} .3809258{col 74}{space 3} .6145339
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2}  .331335{col 33}{space 2} .0880133{col 44}{space 1}    3.76{col 53}{space 3}0.000{col 61}{space 4} .1587891{col 74}{space 3}  .503881
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3226205{col 33}{space 2} .0914897{col 44}{space 1}    3.53{col 53}{space 3}0.000{col 61}{space 4} .1432593{col 74}{space 3} .5019818
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0674138{col 33}{space 2} .0313313{col 44}{space 1}    2.15{col 53}{space 3}0.031{col 61}{space 4} .0059903{col 74}{space 3} .1288374
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.0252242{col 33}{space 2}  .051444{col 44}{space 1}   -0.49{col 53}{space 3}0.624{col 61}{space 4}-.1260778{col 74}{space 3} .0756294
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.0238583{col 33}{space 2} .1776168{col 44}{space 1}   -0.13{col 53}{space 3}0.893{col 61}{space 4}-.3720678{col 74}{space 3} .3243511
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}-.3936456{col 33}{space 2} .1559984{col 44}{space 1}   -2.52{col 53}{space 3}0.012{col 61}{space 4}-.6994733{col 74}{space 3}-.0878179
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0371034{col 33}{space 2} .0326699{col 44}{space 1}   -1.14{col 53}{space 3}0.256{col 61}{space 4}-.1011512{col 74}{space 3} .0269444
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.2317154{col 33}{space 2} .0652053{col 44}{space 1}   -3.55{col 53}{space 3}0.000{col 61}{space 4}-.3595473{col 74}{space 3}-.1038835
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0747773{col 33}{space 2} .0641572{col 44}{space 1}   -1.17{col 53}{space 3}0.244{col 61}{space 4}-.2005544{col 74}{space 3} .0509999
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0470402{col 33}{space 2} .0628709{col 44}{space 1}    0.75{col 53}{space 3}0.454{col 61}{space 4}-.0762153{col 74}{space 3} .1702957
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3023551{col 33}{space 2} .0459196{col 44}{space 1}    6.58{col 53}{space 3}0.000{col 61}{space 4} .2123319{col 74}{space 3} .3923783
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .4518458{col 33}{space 2} .0919276{col 44}{space 1}    4.92{col 53}{space 3}0.000{col 61}{space 4} .2716261{col 74}{space 3} .6320656
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .3815657{col 33}{space 2} .1291915{col 44}{space 1}    2.95{col 53}{space 3}0.003{col 61}{space 4} .1282917{col 74}{space 3} .6348397
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0000706{col 33}{space 2} .0009475{col 44}{space 1}   -0.07{col 53}{space 3}0.941{col 61}{space 4} -.001928{col 74}{space 3} .0017869
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 3.27e-06{col 33}{space 2} .0000134{col 44}{space 1}    0.24{col 53}{space 3}0.807{col 61}{space 4} -.000023{col 74}{space 3} .0000295
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-1.076439{col 33}{space 2} .0804839{col 44}{space 1}  -13.37{col 53}{space 3}0.000{col 61}{space 4}-1.234224{col 74}{space 3}-.9186538
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 9.051585{col 33}{space 2} .0863055{col 44}{space 1}  104.88{col 53}{space 3}0.000{col 61}{space 4} 8.882387{col 74}{space 3} 9.220783
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- REGRESSIONS FOR YEAR 2023 ---"
{res}--- REGRESSIONS FOR YEAR 2023 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2023
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:10,973}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,404}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:128,470,597}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,398}
{txt}{col 50}{lalign 15:F({res:17}, {res:4382})}{col 65} = {res}{ralign 11:87.72}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3124}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .2908923{col 33}{space 2} .0395063{col 44}{space 1}    7.36{col 53}{space 3}0.000{col 61}{space 4} .2134401{col 74}{space 3} .3683446
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .8923329{col 33}{space 2} .0464256{col 44}{space 1}   19.22{col 53}{space 3}0.000{col 61}{space 4} .8013152{col 74}{space 3} .9833505
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3768554{col 33}{space 2} .0479331{col 44}{space 1}    7.86{col 53}{space 3}0.000{col 61}{space 4} .2828825{col 74}{space 3} .4708284
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3602686{col 33}{space 2} .0720339{col 44}{space 1}    5.00{col 53}{space 3}0.000{col 61}{space 4} .2190459{col 74}{space 3} .5014913
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0155263{col 33}{space 2} .0331459{col 44}{space 1}   -0.47{col 53}{space 3}0.640{col 61}{space 4}-.0805089{col 74}{space 3} .0494562
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} -.023418{col 33}{space 2} .0453961{col 44}{space 1}   -0.52{col 53}{space 3}0.606{col 61}{space 4}-.1124171{col 74}{space 3} .0655812
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .2562554{col 33}{space 2} .1136583{col 44}{space 1}    2.25{col 53}{space 3}0.024{col 61}{space 4} .0334278{col 74}{space 3} .4790829
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0529908{col 33}{space 2} .0352719{col 44}{space 1}    1.50{col 53}{space 3}0.133{col 61}{space 4}-.0161598{col 74}{space 3} .1221414
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.0356961{col 33}{space 2} .0429292{col 44}{space 1}   -0.83{col 53}{space 3}0.406{col 61}{space 4}-.1198591{col 74}{space 3} .0484668
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .0108447{col 33}{space 2} .0404423{col 44}{space 1}    0.27{col 53}{space 3}0.789{col 61}{space 4}-.0684426{col 74}{space 3} .0901321
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0331513{col 33}{space 2} .0691602{col 44}{space 1}    0.48{col 53}{space 3}0.632{col 61}{space 4}-.1024375{col 74}{space 3} .1687401
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2765575{col 33}{space 2} .0293902{col 44}{space 1}    9.41{col 53}{space 3}0.000{col 61}{space 4}  .218938{col 74}{space 3}  .334177
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .1443622{col 33}{space 2} .0687399{col 44}{space 1}    2.10{col 53}{space 3}0.036{col 61}{space 4} .0095974{col 74}{space 3} .2791271
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2}-.0200057{col 33}{space 2} .0602653{col 44}{space 1}   -0.33{col 53}{space 3}0.740{col 61}{space 4} -.138156{col 74}{space 3} .0981446
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0031169{col 33}{space 2} .0027298{col 44}{space 1}   -1.14{col 53}{space 3}0.254{col 61}{space 4}-.0084686{col 74}{space 3} .0022348
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} .0000512{col 33}{space 2} .0000394{col 44}{space 1}    1.30{col 53}{space 3}0.194{col 61}{space 4} -.000026{col 74}{space 3} .0001284
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2} -.390271{col 33}{space 2}  .030772{col 44}{space 1}  -12.68{col 53}{space 3}0.000{col 61}{space 4}-.4505997{col 74}{space 3}-.3299423
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}  8.90253{col 33}{space 2} .0748671{col 44}{space 1}  118.91{col 53}{space 3}0.000{col 61}{space 4} 8.755752{col 74}{space 3} 9.049307
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2023
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:68,790}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,974}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:513,414,493}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,968}
{txt}{col 50}{lalign 15:F({res:18}, {res:4951})}{col 65} = {res}{ralign 11:349.17}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.4214}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3005334{col 33}{space 2} .0387614{col 44}{space 1}    7.75{col 53}{space 3}0.000{col 61}{space 4}  .224544{col 74}{space 3} .3765228
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .9859392{col 33}{space 2} .0422193{col 44}{space 1}   23.35{col 53}{space 3}0.000{col 61}{space 4} .9031708{col 74}{space 3} 1.068708
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3421928{col 33}{space 2} .0392932{col 44}{space 1}    8.71{col 53}{space 3}0.000{col 61}{space 4} .2651608{col 74}{space 3} .4192248
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4677025{col 33}{space 2} .0333155{col 44}{space 1}   14.04{col 53}{space 3}0.000{col 61}{space 4} .4023895{col 74}{space 3} .5330155
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0530606{col 33}{space 2} .0198011{col 44}{space 1}   -2.68{col 53}{space 3}0.007{col 61}{space 4}-.0918795{col 74}{space 3}-.0142417
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.1880157{col 33}{space 2} .0543815{col 44}{space 1}   -3.46{col 53}{space 3}0.001{col 61}{space 4}-.2946275{col 74}{space 3}-.0814039
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.0898772{col 33}{space 2} .0569956{col 44}{space 1}   -1.58{col 53}{space 3}0.115{col 61}{space 4}-.2016138{col 74}{space 3} .0218593
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}-.4988369{col 33}{space 2} .0245324{col 44}{space 1}  -20.33{col 53}{space 3}0.000{col 61}{space 4}-.5469312{col 74}{space 3}-.4507425
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0142554{col 33}{space 2} .0205514{col 44}{space 1}    0.69{col 53}{space 3}0.488{col 61}{space 4}-.0260343{col 74}{space 3} .0545452
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1846765{col 33}{space 2} .0519712{col 44}{space 1}   -3.55{col 53}{space 3}0.000{col 61}{space 4}-.2865629{col 74}{space 3}-.0827901
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.1184952{col 33}{space 2} .0488907{col 44}{space 1}   -2.42{col 53}{space 3}0.015{col 61}{space 4}-.2143426{col 74}{space 3}-.0226478
{txt}{space 12}Others  {c |}{col 21}{res}{space 2}-.0241241{col 33}{space 2} .0487518{col 44}{space 1}   -0.49{col 53}{space 3}0.621{col 61}{space 4}-.1196993{col 74}{space 3}  .071451
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2}  .307132{col 33}{space 2} .0206027{col 44}{space 1}   14.91{col 53}{space 3}0.000{col 61}{space 4} .2667415{col 74}{space 3} .3475224
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2187253{col 33}{space 2} .0592471{col 44}{space 1}    3.69{col 53}{space 3}0.000{col 61}{space 4} .1025748{col 74}{space 3} .3348759
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2}-.0510189{col 33}{space 2} .0975928{col 44}{space 1}   -0.52{col 53}{space 3}0.601{col 61}{space 4}-.2423439{col 74}{space 3} .1403061
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0004172{col 33}{space 2} .0005744{col 44}{space 1}   -0.73{col 53}{space 3}0.468{col 61}{space 4}-.0015433{col 74}{space 3} .0007089
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 7.90e-06{col 33}{space 2} 7.55e-06{col 44}{space 1}    1.05{col 53}{space 3}0.295{col 61}{space 4}-6.90e-06{col 74}{space 3} .0000227
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3619861{col 33}{space 2} .0286589{col 44}{space 1}  -12.63{col 53}{space 3}0.000{col 61}{space 4}-.4181703{col 74}{space 3}-.3058019
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 9.148018{col 33}{space 2} .0686489{col 44}{space 1}  133.26{col 53}{space 3}0.000{col 61}{space 4} 9.013436{col 74}{space 3}   9.2826
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2023
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:29,972}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,408}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:416,954,706}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,402}
{txt}{col 50}{lalign 15:F({res:18}, {res:6385})}{col 65} = {res}{ralign 11:197.86}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3974}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2}-.0149953{col 33}{space 2} .0855948{col 44}{space 1}   -0.18{col 53}{space 3}0.861{col 61}{space 4}-.1827898{col 74}{space 3} .1527992
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .0815766{col 33}{space 2} .1015789{col 44}{space 1}    0.80{col 53}{space 3}0.422{col 61}{space 4} -.117552{col 74}{space 3} .2807053
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3003013{col 33}{space 2} .0725516{col 44}{space 1}    4.14{col 53}{space 3}0.000{col 61}{space 4} .1580759{col 74}{space 3} .4425267
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2325986{col 33}{space 2}  .087246{col 44}{space 1}    2.67{col 53}{space 3}0.008{col 61}{space 4} .0615673{col 74}{space 3} .4036299
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .1515699{col 33}{space 2} .0297486{col 44}{space 1}    5.10{col 53}{space 3}0.000{col 61}{space 4} .0932526{col 74}{space 3} .2098872
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .1434078{col 33}{space 2} .0233169{col 44}{space 1}    6.15{col 53}{space 3}0.000{col 61}{space 4} .0976988{col 74}{space 3} .1891167
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .3285748{col 33}{space 2} .0571342{col 44}{space 1}    5.75{col 53}{space 3}0.000{col 61}{space 4} .2165727{col 74}{space 3} .4405769
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .5853758{col 33}{space 2} .1063225{col 44}{space 1}    5.51{col 53}{space 3}0.000{col 61}{space 4} .3769482{col 74}{space 3} .7938034
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.1276271{col 33}{space 2} .0308473{col 44}{space 1}   -4.14{col 53}{space 3}0.000{col 61}{space 4}-.1880981{col 74}{space 3}-.0671562
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0829836{col 33}{space 2} .0270512{col 44}{space 1}    3.07{col 53}{space 3}0.002{col 61}{space 4} .0299543{col 74}{space 3} .1360129
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .1710461{col 33}{space 2} .0247498{col 44}{space 1}    6.91{col 53}{space 3}0.000{col 61}{space 4} .1225283{col 74}{space 3}  .219564
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .3939535{col 33}{space 2} .0788797{col 44}{space 1}    4.99{col 53}{space 3}0.000{col 61}{space 4} .2393229{col 74}{space 3} .5485841
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2232891{col 33}{space 2} .0253385{col 44}{space 1}    8.81{col 53}{space 3}0.000{col 61}{space 4} .1736171{col 74}{space 3}  .272961
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .4759193{col 33}{space 2} .0532524{col 44}{space 1}    8.94{col 53}{space 3}0.000{col 61}{space 4} .3715267{col 74}{space 3} .5803119
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .4255584{col 33}{space 2} .1282844{col 44}{space 1}    3.32{col 53}{space 3}0.001{col 61}{space 4} .1740782{col 74}{space 3} .6770387
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2} .0028868{col 33}{space 2} .0017997{col 44}{space 1}    1.60{col 53}{space 3}0.109{col 61}{space 4}-.0006411{col 74}{space 3} .0064148
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-.0000473{col 33}{space 2} .0000266{col 44}{space 1}   -1.78{col 53}{space 3}0.076{col 61}{space 4}-.0000994{col 74}{space 3} 4.90e-06
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-1.098786{col 33}{space 2} .0406213{col 44}{space 1}  -27.05{col 53}{space 3}0.000{col 61}{space 4}-1.178417{col 74}{space 3}-1.019155
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.909004{col 33}{space 2} .0647727{col 44}{space 1}  137.54{col 53}{space 3}0.000{col 61}{space 4} 8.782028{col 74}{space 3}  9.03598
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2023
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:44,190}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,497}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:288,862,846}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,491}
{txt}{col 50}{lalign 15:F({res:18}, {res:4474})}{col 65} = {res}{ralign 11:42.69}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3302}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .2422408{col 33}{space 2} .0498903{col 44}{space 1}    4.86{col 53}{space 3}0.000{col 61}{space 4} .1444312{col 74}{space 3} .3400504
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .5486538{col 33}{space 2}  .058245{col 44}{space 1}    9.42{col 53}{space 3}0.000{col 61}{space 4}  .434465{col 74}{space 3} .6628427
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .1869262{col 33}{space 2} .0768273{col 44}{space 1}    2.43{col 53}{space 3}0.015{col 61}{space 4} .0363069{col 74}{space 3} .3375454
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4951453{col 33}{space 2} .0816319{col 44}{space 1}    6.07{col 53}{space 3}0.000{col 61}{space 4} .3351066{col 74}{space 3}  .655184
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0413305{col 33}{space 2} .0291996{col 44}{space 1}    1.42{col 53}{space 3}0.157{col 61}{space 4} -.015915{col 74}{space 3} .0985761
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.0388848{col 33}{space 2} .0432161{col 44}{space 1}   -0.90{col 53}{space 3}0.368{col 61}{space 4}-.1236097{col 74}{space 3}   .04584
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .0415828{col 33}{space 2} .1728462{col 44}{space 1}    0.24{col 53}{space 3}0.810{col 61}{space 4}-.2972808{col 74}{space 3} .3804465
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}   .29567{col 33}{space 2} .1125926{col 44}{space 1}    2.63{col 53}{space 3}0.009{col 61}{space 4} .0749332{col 74}{space 3} .5164069
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.1050123{col 33}{space 2} .0270494{col 44}{space 1}   -3.88{col 53}{space 3}0.000{col 61}{space 4}-.1580424{col 74}{space 3}-.0519821
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1988188{col 33}{space 2} .0808133{col 44}{space 1}   -2.46{col 53}{space 3}0.014{col 61}{space 4}-.3572527{col 74}{space 3}-.0403848
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0398195{col 33}{space 2} .0749762{col 44}{space 1}   -0.53{col 53}{space 3}0.595{col 61}{space 4}-.1868098{col 74}{space 3} .1071708
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0580219{col 33}{space 2} .0750434{col 44}{space 1}    0.77{col 53}{space 3}0.439{col 61}{space 4}-.0891001{col 74}{space 3}  .205144
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .1998336{col 33}{space 2} .0375398{col 44}{space 1}    5.32{col 53}{space 3}0.000{col 61}{space 4} .1262371{col 74}{space 3} .2734301
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .4553916{col 33}{space 2} .1123731{col 44}{space 1}    4.05{col 53}{space 3}0.000{col 61}{space 4} .2350849{col 74}{space 3} .6756983
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2}-.0447953{col 33}{space 2} .1035798{col 44}{space 1}   -0.43{col 53}{space 3}0.665{col 61}{space 4}-.2478626{col 74}{space 3} .1582721
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0010407{col 33}{space 2} .0007015{col 44}{space 1}   -1.48{col 53}{space 3}0.138{col 61}{space 4}-.0024159{col 74}{space 3} .0003345
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} .0000165{col 33}{space 2} 9.60e-06{col 44}{space 1}    1.71{col 53}{space 3}0.086{col 61}{space 4}-2.36e-06{col 74}{space 3} .0000353
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-1.026856{col 33}{space 2} .0573775{col 44}{space 1}  -17.90{col 53}{space 3}0.000{col 61}{space 4}-1.139344{col 74}{space 3}-.9143674
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 9.349026{col 33}{space 2} .0955367{col 44}{space 1}   97.86{col 53}{space 3}0.000{col 61}{space 4} 9.161727{col 74}{space 3} 9.536325
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- REGRESSIONS FOR YEAR 2024 ---"
{res}--- REGRESSIONS FOR YEAR 2024 ---
{txt}
{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 1 & Occupation == 2 & Year == 2024
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:11,567}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:4,612}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:140,342,022}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:4,606}
{txt}{col 50}{lalign 15:F({res:18}, {res:4589})}{col 65} = {res}{ralign 11:1283.96}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3111}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .2878153{col 33}{space 2}  .033641{col 44}{space 1}    8.56{col 53}{space 3}0.000{col 61}{space 4} .2218628{col 74}{space 3} .3537678
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .8363884{col 33}{space 2} .0396509{col 44}{space 1}   21.09{col 53}{space 3}0.000{col 61}{space 4} .7586536{col 74}{space 3} .9141231
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3820561{col 33}{space 2} .0386179{col 44}{space 1}    9.89{col 53}{space 3}0.000{col 61}{space 4} .3063465{col 74}{space 3} .4577658
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .3616675{col 33}{space 2} .0614086{col 44}{space 1}    5.89{col 53}{space 3}0.000{col 61}{space 4} .2412771{col 74}{space 3} .4820579
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0323378{col 33}{space 2} .0218756{col 44}{space 1}    1.48{col 53}{space 3}0.139{col 61}{space 4}-.0105488{col 74}{space 3} .0752244
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0483311{col 33}{space 2} .0443725{col 44}{space 1}    1.09{col 53}{space 3}0.276{col 61}{space 4}-.0386603{col 74}{space 3} .1353225
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .0424567{col 33}{space 2} .0703529{col 44}{space 1}    0.60{col 53}{space 3}0.546{col 61}{space 4}-.0954687{col 74}{space 3} .1803821
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} 1.402287{col 33}{space 2} .0477048{col 44}{space 1}   29.40{col 53}{space 3}0.000{col 61}{space 4} 1.308763{col 74}{space 3} 1.495811
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2} .0190918{col 33}{space 2} .0207076{col 44}{space 1}    0.92{col 53}{space 3}0.357{col 61}{space 4}-.0215051{col 74}{space 3} .0596886
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.0461675{col 33}{space 2} .0377797{col 44}{space 1}   -1.22{col 53}{space 3}0.222{col 61}{space 4}-.1202337{col 74}{space 3} .0278988
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0044699{col 33}{space 2} .0341981{col 44}{space 1}   -0.13{col 53}{space 3}0.896{col 61}{space 4}-.0715146{col 74}{space 3} .0625749
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0755373{col 33}{space 2} .0400731{col 44}{space 1}    1.88{col 53}{space 3}0.059{col 61}{space 4}-.0030252{col 74}{space 3} .1540998
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2777521{col 33}{space 2} .0233662{col 44}{space 1}   11.89{col 53}{space 3}0.000{col 61}{space 4} .2319433{col 74}{space 3}  .323561
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2515522{col 33}{space 2} .0597363{col 44}{space 1}    4.21{col 53}{space 3}0.000{col 61}{space 4} .1344405{col 74}{space 3} .3686639
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2077817{col 33}{space 2} .0875757{col 44}{space 1}    2.37{col 53}{space 3}0.018{col 61}{space 4} .0360914{col 74}{space 3} .3794721
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0017014{col 33}{space 2} .0017872{col 44}{space 1}   -0.95{col 53}{space 3}0.341{col 61}{space 4}-.0052051{col 74}{space 3} .0018023
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}  .000016{col 33}{space 2} .0000231{col 44}{space 1}    0.69{col 53}{space 3}0.488{col 61}{space 4}-.0000292{col 74}{space 3} .0000612
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.4709704{col 33}{space 2} .0314337{col 44}{space 1}  -14.98{col 53}{space 3}0.000{col 61}{space 4}-.5325955{col 74}{space 3}-.4093453
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.981252{col 33}{space 2} .0602703{col 44}{space 1}  149.02{col 53}{space 3}0.000{col 61}{space 4} 8.863093{col 74}{space 3}  9.09941
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnRegWage $mincer_vars i.Sex if Sector == 2 & Occupation == 2 & Year == 2024
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:68,737}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,477}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:562,599,125}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,471}
{txt}{col 50}{lalign 15:F({res:18}, {res:5454})}{col 65} = {res}{ralign 11:314.07}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.4359}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}          lnRegWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .3671395{col 33}{space 2} .0255457{col 44}{space 1}   14.37{col 53}{space 3}0.000{col 61}{space 4} .3170597{col 74}{space 3} .4172194
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} 1.056658{col 33}{space 2} .0274838{col 44}{space 1}   38.45{col 53}{space 3}0.000{col 61}{space 4} 1.002778{col 74}{space 3} 1.110537
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .3804014{col 33}{space 2} .0236121{col 44}{space 1}   16.11{col 53}{space 3}0.000{col 61}{space 4} .3341123{col 74}{space 3} .4266905
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2}   .43936{col 33}{space 2}  .024127{col 44}{space 1}   18.21{col 53}{space 3}0.000{col 61}{space 4} .3920615{col 74}{space 3} .4866585
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}-.0296108{col 33}{space 2} .0144952{col 44}{space 1}   -2.04{col 53}{space 3}0.041{col 61}{space 4}-.0580271{col 74}{space 3}-.0011945
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}-.1995317{col 33}{space 2}  .027351{col 44}{space 1}   -7.30{col 53}{space 3}0.000{col 61}{space 4}-.2531505{col 74}{space 3}-.1459129
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2}-.1050949{col 33}{space 2} .0660195{col 44}{space 1}   -1.59{col 53}{space 3}0.111{col 61}{space 4}-.2345195{col 74}{space 3} .0243297
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .4383384{col 33}{space 2} .1202574{col 44}{space 1}    3.65{col 53}{space 3}0.000{col 61}{space 4} .2025861{col 74}{space 3} .6740908
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}  .054088{col 33}{space 2}  .013727{col 44}{space 1}    3.94{col 53}{space 3}0.000{col 61}{space 4} .0271775{col 74}{space 3} .0809984
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1132976{col 33}{space 2} .0372831{col 44}{space 1}   -3.04{col 53}{space 3}0.002{col 61}{space 4}-.1863873{col 74}{space 3} -.040208
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2}-.0802466{col 33}{space 2} .0353322{col 44}{space 1}   -2.27{col 53}{space 3}0.023{col 61}{space 4}-.1495117{col 74}{space 3}-.0109815
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .0288934{col 33}{space 2} .0362042{col 44}{space 1}    0.80{col 53}{space 3}0.425{col 61}{space 4}-.0420812{col 74}{space 3}  .099868
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .3296466{col 33}{space 2} .0144529{col 44}{space 1}   22.81{col 53}{space 3}0.000{col 61}{space 4} .3013131{col 74}{space 3} .3579801
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .2515344{col 33}{space 2} .0357509{col 44}{space 1}    7.04{col 53}{space 3}0.000{col 61}{space 4} .1814484{col 74}{space 3} .3216203
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .2212295{col 33}{space 2}  .059011{col 44}{space 1}    3.75{col 53}{space 3}0.000{col 61}{space 4} .1055444{col 74}{space 3} .3369146
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0000954{col 33}{space 2} .0005777{col 44}{space 1}   -0.17{col 53}{space 3}0.869{col 61}{space 4} -.001228{col 74}{space 3} .0010371
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} 6.98e-06{col 33}{space 2} 7.54e-06{col 44}{space 1}    0.93{col 53}{space 3}0.355{col 61}{space 4}-7.81e-06{col 74}{space 3} .0000218
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-.3731474{col 33}{space 2} .0162279{col 44}{space 1}  -22.99{col 53}{space 3}0.000{col 61}{space 4}-.4049605{col 74}{space 3}-.3413342
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 9.029763{col 33}{space 2} .0433074{col 44}{space 1}  208.50{col 53}{space 3}0.000{col 61}{space 4} 8.944864{col 74}{space 3} 9.114663
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 1 & Occupation == 1 & Year == 2024
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:31,368}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:6,588}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:415,506,701}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:6,582}
{txt}{col 50}{lalign 15:F({res:18}, {res:6565})}{col 65} = {res}{ralign 11:265.14}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.4275}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2} .1432714{col 33}{space 2} .0176628{col 44}{space 1}    8.11{col 53}{space 3}0.000{col 61}{space 4} .1086466{col 74}{space 3} .1778962
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2342106{col 33}{space 2}  .028226{col 44}{space 1}    8.30{col 53}{space 3}0.000{col 61}{space 4} .1788785{col 74}{space 3} .2895427
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .1801965{col 33}{space 2} .0414431{col 44}{space 1}    4.35{col 53}{space 3}0.000{col 61}{space 4} .0989546{col 74}{space 3} .2614383
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .2690143{col 33}{space 2} .0929791{col 44}{space 1}    2.89{col 53}{space 3}0.004{col 61}{space 4} .0867451{col 74}{space 3} .4512834
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2}  .122826{col 33}{space 2} .0159062{col 44}{space 1}    7.72{col 53}{space 3}0.000{col 61}{space 4} .0916447{col 74}{space 3} .1540072
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2}  .204999{col 33}{space 2} .0213695{col 44}{space 1}    9.59{col 53}{space 3}0.000{col 61}{space 4}  .163108{col 74}{space 3} .2468901
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .3082858{col 33}{space 2} .0485505{col 44}{space 1}    6.35{col 53}{space 3}0.000{col 61}{space 4}  .213111{col 74}{space 3} .4034605
{txt}{space 15}18+  {c |}{col 21}{res}{space 2} .3794888{col 33}{space 2} .1007409{col 44}{space 1}    3.77{col 53}{space 3}0.000{col 61}{space 4} .1820039{col 74}{space 3} .5769736
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0199715{col 33}{space 2} .0144101{col 44}{space 1}   -1.39{col 53}{space 3}0.166{col 61}{space 4}-.0482199{col 74}{space 3}  .008277
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2} .0839628{col 33}{space 2} .0253261{col 44}{space 1}    3.32{col 53}{space 3}0.001{col 61}{space 4} .0343154{col 74}{space 3} .1336102
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .1666729{col 33}{space 2} .0220306{col 44}{space 1}    7.57{col 53}{space 3}0.000{col 61}{space 4} .1234858{col 74}{space 3} .2098601
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .2517007{col 33}{space 2} .0245419{col 44}{space 1}   10.26{col 53}{space 3}0.000{col 61}{space 4} .2035906{col 74}{space 3} .2998109
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .2343732{col 33}{space 2} .0230066{col 44}{space 1}   10.19{col 53}{space 3}0.000{col 61}{space 4} .1892727{col 74}{space 3} .2794736
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2}  .543479{col 33}{space 2} .0435632{col 44}{space 1}   12.48{col 53}{space 3}0.000{col 61}{space 4}  .458081{col 74}{space 3} .6288771
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .4532466{col 33}{space 2}  .085362{col 44}{space 1}    5.31{col 53}{space 3}0.000{col 61}{space 4} .2859093{col 74}{space 3} .6205839
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0001561{col 33}{space 2} .0011172{col 44}{space 1}   -0.14{col 53}{space 3}0.889{col 61}{space 4}-.0023463{col 74}{space 3}  .002034
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2}-1.13e-06{col 33}{space 2} .0000145{col 44}{space 1}   -0.08{col 53}{space 3}0.938{col 61}{space 4}-.0000296{col 74}{space 3} .0000274
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2}-1.158893{col 33}{space 2}  .018621{col 44}{space 1}  -62.24{col 53}{space 3}0.000{col 61}{space 4}-1.195396{col 74}{space 3}-1.122389
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 8.839522{col 33}{space 2} .0389862{col 44}{space 1}  226.73{col 53}{space 3}0.000{col 61}{space 4} 8.763096{col 74}{space 3} 8.915947
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. svy: regress lnSelfWage $mincer_vars i.Sex if Sector == 2 & Occupation == 1 & Year == 2024
{res}{txt}(running {bf:regress} on estimation sample)
{res}
{txt}Survey: Linear regression

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 5:6}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:47,027}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 5:5,085}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:346,274,840}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:5,079}
{txt}{col 50}{lalign 15:F({res:18}, {res:5062})}{col 65} = {res}{ralign 11:113.53}
{txt}{col 50}{lalign 15:Prob > F}{col 65} = {res}{ralign 11:0.0000}
{txt}{col 50}{lalign 15:R-squared}{col 65} = {res}{ralign 11:0.3835}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}  Linearized
{col 1}         lnSelfWage{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}GenEdu {c |}
{space 2}Up to HS/Diploma  {c |}{col 21}{res}{space 2}  .242624{col 33}{space 2} .0300954{col 44}{space 1}    8.06{col 53}{space 3}0.000{col 61}{space 4} .1836241{col 74}{space 3} .3016239
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .6353468{col 33}{space 2} .0366842{col 44}{space 1}   17.32{col 53}{space 3}0.000{col 61}{space 4} .5634299{col 74}{space 3} .7072637
{txt}{space 19} {c |}
{space 12}TechEdu {c |}
{space 11}Diploma  {c |}{col 21}{res}{space 2} .2894566{col 33}{space 2} .0441029{col 44}{space 1}    6.56{col 53}{space 3}0.000{col 61}{space 4} .2029959{col 74}{space 3} .3759172
{txt}{space 9}Graduate+  {c |}{col 21}{res}{space 2} .4231274{col 33}{space 2} .0610257{col 44}{space 1}    6.93{col 53}{space 3}0.000{col 61}{space 4} .3034907{col 74}{space 3}  .542764
{txt}{space 19} {c |}
{space 13}HHSize {c |}
{space 15}4-6  {c |}{col 21}{res}{space 2} .0297563{col 33}{space 2} .0214535{col 44}{space 1}    1.39{col 53}{space 3}0.165{col 61}{space 4}-.0123017{col 74}{space 3} .0718144
{txt}{space 14}7-10  {c |}{col 21}{res}{space 2} .0231405{col 33}{space 2} .0395201{col 44}{space 1}    0.59{col 53}{space 3}0.558{col 61}{space 4}-.0543359{col 74}{space 3}  .100617
{txt}{space 13}11-17  {c |}{col 21}{res}{space 2} .0525957{col 33}{space 2} .0798235{col 44}{space 1}    0.66{col 53}{space 3}0.510{col 61}{space 4}-.1038927{col 74}{space 3} .2090841
{txt}{space 15}18+  {c |}{col 21}{res}{space 2}-.1031492{col 33}{space 2}  .162315{col 44}{space 1}   -0.64{col 53}{space 3}0.525{col 61}{space 4}-.4213565{col 74}{space 3} .2150581
{txt}{space 19} {c |}
{space 12}Trained {c |}
{space 15}Yes  {c |}{col 21}{res}{space 2}-.0623266{col 33}{space 2} .0195337{col 44}{space 1}   -3.19{col 53}{space 3}0.001{col 61}{space 4} -.100621{col 74}{space 3}-.0240322
{txt}{space 19} {c |}
{space 8}SocialGroup {c |}
{space 16}SC  {c |}{col 21}{res}{space 2}-.1105632{col 33}{space 2} .0629856{col 44}{space 1}   -1.76{col 53}{space 3}0.079{col 61}{space 4}-.2340421{col 74}{space 3} .0129158
{txt}{space 15}OBC  {c |}{col 21}{res}{space 2} .0501837{col 33}{space 2} .0603619{col 44}{space 1}    0.83{col 53}{space 3}0.406{col 61}{space 4}-.0681517{col 74}{space 3}  .168519
{txt}{space 12}Others  {c |}{col 21}{res}{space 2} .1686459{col 33}{space 2} .0620381{col 44}{space 1}    2.72{col 53}{space 3}0.007{col 61}{space 4} .0470245{col 74}{space 3} .2902673
{txt}{space 19} {c |}
{space 6}MaritalStatus {c |}
{space 1}Currently Married  {c |}{col 21}{res}{space 2} .1990502{col 33}{space 2} .0344828{col 44}{space 1}    5.77{col 53}{space 3}0.000{col 61}{space 4} .1314491{col 74}{space 3} .2666513
{txt}{space 11}Widowed  {c |}{col 21}{res}{space 2} .3873383{col 33}{space 2} .0631631{col 44}{space 1}    6.13{col 53}{space 3}0.000{col 61}{space 4} .2635113{col 74}{space 3} .5111653
{txt}Divorced/Separated  {c |}{col 21}{res}{space 2} .1474376{col 33}{space 2} .0794454{col 44}{space 1}    1.86{col 53}{space 3}0.064{col 61}{space 4}-.0083096{col 74}{space 3} .3031848
{txt}{space 19} {c |}
{space 11}Age_cont {c |}{col 21}{res}{space 2}-.0019134{col 33}{space 2} .0008308{col 44}{space 1}   -2.30{col 53}{space 3}0.021{col 61}{space 4}-.0035421{col 74}{space 3}-.0002846
{txt}{space 8}Age_sq_cont {c |}{col 21}{res}{space 2} .0000282{col 33}{space 2} .0000115{col 44}{space 1}    2.45{col 53}{space 3}0.014{col 61}{space 4} 5.67e-06{col 74}{space 3} .0000507
{txt}{space 19} {c |}
{space 16}Sex {c |}
{space 12}Female  {c |}{col 21}{res}{space 2} -1.12033{col 33}{space 2} .0408508{col 44}{space 1}  -27.42{col 53}{space 3}0.000{col 61}{space 4}-1.200416{col 74}{space 3}-1.040245
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 9.331006{col 33}{space 2} .0744259{col 44}{space 1}  125.37{col 53}{space 3}0.000{col 61}{space 4} 9.185099{col 74}{space 3} 9.476913
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. * STEP 8: BLINDER-OAXACA DECOMPOSITION (ALL-INDIA) 
. 
. * The `relax` option added to all commands to handle r(499) error
. 
. display "--- 8.1: Blinder-Oaxaca: Rural Regular Salaried (Pooled) ---"
{res}--- 8.1: Blinder-Oaxaca: Rural Regular Salaried (Pooled) ---
{txt}
{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 1 & Occupation == 2 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 2 has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:7}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:61,708}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:12,906}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:657,514,138}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:12,899}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}    49,980
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}    11,728

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.494949{col 26}{space 2} .0076256{col 37}{space 1} 1245.14{col 46}{space 3}0.000{col 54}{space 4} 9.480002{col 67}{space 3} 9.509896
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2}  9.04189{col 26}{space 2} .0181886{col 37}{space 1}  497.12{col 46}{space 3}0.000{col 54}{space 4} 9.006238{col 67}{space 3} 9.077543
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .4530589{col 26}{space 2} .0180556{col 37}{space 1}   25.09{col 46}{space 3}0.000{col 54}{space 4} .4176672{col 67}{space 3} .4884506
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0105186{col 26}{space 2} .0104777{col 37}{space 1}    1.00{col 46}{space 3}0.315{col 54}{space 4}-.0100192{col 67}{space 3} .0310565
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .4425402{col 26}{space 2} .0159052{col 37}{space 1}   27.82{col 46}{space 3}0.000{col 54}{space 4} .4113638{col 67}{space 3} .4737167
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0443607{col 26}{space 2} .0048218{col 37}{space 1}    9.20{col 46}{space 3}0.000{col 54}{space 4} .0349093{col 67}{space 3} .0538121
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0297352{col 26}{space 2} .0089055{col 37}{space 1}   -3.34{col 46}{space 3}0.001{col 54}{space 4}-.0471912{col 67}{space 3}-.0122792
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0095983{col 26}{space 2} .0023959{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-.0142947{col 67}{space 3}-.0049019
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0022063{col 26}{space 2} .0012761{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-.0047077{col 67}{space 3} .0002951
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0010917{col 26}{space 2} .0009587{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0007875{col 67}{space 3}  .002971
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0013672{col 26}{space 2} .0008244{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0002487{col 67}{space 3} .0029831
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0008783{col 26}{space 2} .0004457{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4} 4.63e-06{col 67}{space 3}  .001752
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}-.0002896{col 26}{space 2} .0002878{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0008538{col 67}{space 3} .0002745
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0055962{col 26}{space 2} .0012015{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .0032412{col 67}{space 3} .0079513
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0002483{col 26}{space 2} .0004222{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-.0005793{col 67}{space 3}  .001076
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0003997{col 26}{space 2} .0004366{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-.0012554{col 67}{space 3} .0004561
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}  .001793{col 26}{space 2}  .001135{col 37}{space 1}    1.58{col 46}{space 3}0.114{col 54}{space 4}-.0004318{col 67}{space 3} .0040178
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0410966{col 26}{space 2} .0033633{col 37}{space 1}   12.22{col 46}{space 3}0.000{col 54}{space 4} .0345041{col 67}{space 3} .0476892
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} -.040268{col 26}{space 2} .0055997{col 37}{space 1}   -7.19{col 46}{space 3}0.000{col 54}{space 4}-.0512441{col 67}{space 3}-.0292918
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0031964{col 26}{space 2} .0012007{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}  -.00555{col 67}{space 3}-.0008427
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}  -.00005{col 26}{space 2} .0005443{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.0011169{col 67}{space 3} .0010168
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0001701{col 26}{space 2} .0005269{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4} -.001203{col 67}{space 3} .0008628
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0590374{col 26}{space 2} .0290318{col 37}{space 1}   -2.03{col 46}{space 3}0.042{col 54}{space 4}-.1159441{col 67}{space 3}-.0021307
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} -.082184{col 26}{space 2} .0167555{col 37}{space 1}   -4.90{col 46}{space 3}0.000{col 54}{space 4}-.1150273{col 67}{space 3}-.0493407
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} -.026361{col 26}{space 2}  .004462{col 37}{space 1}   -5.91{col 46}{space 3}0.000{col 54}{space 4}-.0351072{col 67}{space 3}-.0176149
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0035092{col 26}{space 2} .0036377{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.0106397{col 67}{space 3} .0036212
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0045441{col 26}{space 2} .0189068{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-.0416042{col 67}{space 3} .0325161
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0002268{col 26}{space 2} .0048865{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-.0093514{col 67}{space 3} .0098051
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0005836{col 26}{space 2} .0021659{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4} -.004829{col 67}{space 3} .0036618
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}-1.49e-06{col 26}{space 2} 3.01e-06{col 37}{space 1}   -0.49{col 46}{space 3}0.621{col 54}{space 4}-7.39e-06{col 67}{space 3} 4.41e-06
{txt}dum_Trained2 {c |}{col 14}{res}{space 2}-.0058936{col 26}{space 2} .0092649{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-.0240542{col 67}{space 3}  .012267
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0036832{col 26}{space 2} .0094723{col 37}{space 1}    0.39{col 46}{space 3}0.697{col 54}{space 4}-.0148839{col 67}{space 3} .0222503
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0093342{col 26}{space 2} .0168818{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4}-.0237567{col 67}{space 3} .0424251
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0242672{col 26}{space 2} .0117246{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0012853{col 67}{space 3} .0472491
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0118131{col 26}{space 2} .0263647{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-.0398656{col 67}{space 3} .0634918
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0113152{col 26}{space 2}  .006892{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-.0248245{col 67}{space 3} .0021942
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} -.000497{col 26}{space 2} .0017744{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-.0039751{col 67}{space 3} .0029812
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0490705{col 26}{space 2} .0835094{col 37}{space 1}   -0.59{col 46}{space 3}0.557{col 54}{space 4}-.2127612{col 67}{space 3} .1146203
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0298652{col 26}{space 2} .0541577{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.0762919{col 67}{space 3} .1360223
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6063475{col 26}{space 2} .0839952{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} .4417046{col 67}{space 3} .7709905
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- 8.2: Blinder-Oaxaca: Urban Regular Salaried (Pooled) ---"
{res}--- 8.2: Blinder-Oaxaca: Urban Regular Salaried (Pooled) ---
{txt}
{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 2 & Occupation == 2 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 2 has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:6}{txt}{col 48}{lalign 15:Number of obs}{col 63} = {res}{ralign 13:341,722}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:15,352}{txt}{col 48}{lalign 15:Population size}{col 63} = {res}{ralign 13:2,565,803,832}
{txt}{col 48}{lalign 15:Design df}{col 63} = {res}{ralign 13:15,346}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}   264,593
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}    77,129

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.771288{col 26}{space 2} .0064919{col 37}{space 1} 1505.16{col 46}{space 3}0.000{col 54}{space 4} 9.758563{col 67}{space 3} 9.784013
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 9.456939{col 26}{space 2} .0141971{col 37}{space 1}  666.12{col 46}{space 3}0.000{col 54}{space 4} 9.429111{col 67}{space 3} 9.484767
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .3143489{col 26}{space 2} .0144533{col 37}{space 1}   21.75{col 46}{space 3}0.000{col 54}{space 4} .2860187{col 67}{space 3}  .342679
{txt}{space 3}explained {c |}{col 14}{res}{space 2}-.0373532{col 26}{space 2} .0094634{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-.0559025{col 67}{space 3}-.0188038
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .3517021{col 26}{space 2} .0117307{col 37}{space 1}   29.98{col 46}{space 3}0.000{col 54}{space 4} .3287085{col 67}{space 3} .3746956
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0642559{col 26}{space 2} .0044992{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .0554369{col 67}{space 3} .0730748
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.1054604{col 26}{space 2}   .00919{col 37}{space 1}  -11.48{col 46}{space 3}0.000{col 54}{space 4}-.1234739{col 67}{space 3}-.0874469
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0025384{col 26}{space 2} .0015301{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0004607{col 67}{space 3} .0055375
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0135166{col 26}{space 2} .0028301{col 37}{space 1}   -4.78{col 46}{space 3}0.000{col 54}{space 4}-.0190639{col 67}{space 3}-.0079693
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0018102{col 26}{space 2} .0005599{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0029077{col 67}{space 3}-.0007127
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0037417{col 26}{space 2} .0007388{col 37}{space 1}   -5.06{col 46}{space 3}0.000{col 54}{space 4}-.0051899{col 67}{space 3}-.0022935
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0001276{col 26}{space 2} .0018139{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-.0034278{col 67}{space 3} .0036829
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} .0000316{col 26}{space 2} .0000238{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.0000151{col 67}{space 3} .0000783
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0051074{col 26}{space 2} .0009095{col 37}{space 1}    5.62{col 46}{space 3}0.000{col 54}{space 4} .0033248{col 67}{space 3} .0068901
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}  .003621{col 26}{space 2} .0012043{col 37}{space 1}    3.01{col 46}{space 3}0.003{col 54}{space 4} .0012603{col 67}{space 3} .0059816
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0020183{col 26}{space 2} .0009985{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0039755{col 67}{space 3}-.0000611
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0000185{col 26}{space 2} .0003261{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.0006207{col 67}{space 3} .0006576
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0557548{col 26}{space 2} .0032735{col 37}{space 1}   17.03{col 46}{space 3}0.000{col 54}{space 4} .0493383{col 67}{space 3} .0621712
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0393715{col 26}{space 2} .0037646{col 37}{space 1}  -10.46{col 46}{space 3}0.000{col 54}{space 4}-.0467505{col 67}{space 3}-.0319925
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0028709{col 26}{space 2} .0007594{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.0043593{col 67}{space 3}-.0013824
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-1.67e-07{col 26}{space 2} .0001144{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-.0002244{col 67}{space 3}  .000224
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0000184{col 26}{space 2} .0001042{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-.0002228{col 67}{space 3} .0001859
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0603088{col 26}{space 2} .0178697{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.0953356{col 67}{space 3}-.0252821
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.1683084{col 26}{space 2} .0182123{col 37}{space 1}   -9.24{col 46}{space 3}0.000{col 54}{space 4}-.2040068{col 67}{space 3}-.1326101
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0081415{col 26}{space 2} .0028588{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-.0137451{col 67}{space 3} -.002538
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0064413{col 26}{space 2} .0037267{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0008634{col 67}{space 3}  .013746
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0335315{col 26}{space 2} .0107275{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4} .0125044{col 67}{space 3} .0545586
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0036832{col 26}{space 2} .0026654{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-.0015413{col 67}{space 3} .0089078
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0042161{col 26}{space 2} .0022986{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0002895{col 67}{space 3} .0087216
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}-1.80e-06{col 26}{space 2} 1.86e-06{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-5.44e-06{col 67}{space 3} 1.85e-06
{txt}dum_Trained2 {c |}{col 14}{res}{space 2}-.0073038{col 26}{space 2} .0071875{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-.0213921{col 67}{space 3} .0067845
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0046761{col 26}{space 2} .0090007{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-.0129664{col 67}{space 3} .0223185
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0016359{col 26}{space 2} .0191161{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-.0358339{col 67}{space 3} .0391057
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0109495{col 26}{space 2}  .020012{col 37}{space 1}   -0.55{col 46}{space 3}0.584{col 54}{space 4}-.0501754{col 67}{space 3} .0282765
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0932034{col 26}{space 2} .0149569{col 37}{space 1}    6.23{col 46}{space 3}0.000{col 54}{space 4} .0638861{col 67}{space 3} .1225207
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} .0007254{col 26}{space 2} .0033398{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4} -.005821{col 67}{space 3} .0072718
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0026285{col 26}{space 2} .0010885{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0004949{col 67}{space 3} .0047621
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0186904{col 26}{space 2} .0263675{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.0329929{col 67}{space 3} .0703738
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0142613{col 26}{space 2} .0155244{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0446911{col 67}{space 3} .0161684
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4515455{col 26}{space 2} .0626678{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .3287091{col 67}{space 3} .5743819
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- 8.3: Blinder-Oaxaca: Rural Self-Employed (Pooled) ---"
{res}--- 8.3: Blinder-Oaxaca: Rural Self-Employed (Pooled) ---
{txt}
{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 1 & Occupation == 1 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:7}{txt}{col 48}{lalign 15:Number of obs}{col 63} = {res}{ralign 13:169,925}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:16,210}{txt}{col 48}{lalign 15:Population size}{col 63} = {res}{ralign 13:2,141,037,847}
{txt}{col 48}{lalign 15:Design df}{col 63} = {res}{ralign 13:16,203}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}   141,831
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}    28,094

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.164055{col 26}{space 2}  .013221{col 37}{space 1}  693.14{col 46}{space 3}0.000{col 54}{space 4} 9.138141{col 67}{space 3}  9.18997
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.248487{col 26}{space 2} .0105756{col 37}{space 1}  779.95{col 46}{space 3}0.000{col 54}{space 4} 8.227758{col 67}{space 3} 8.269217
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .9155679{col 26}{space 2} .0165121{col 37}{space 1}   55.45{col 46}{space 3}0.000{col 54}{space 4} .8832025{col 67}{space 3} .9479334
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0019153{col 26}{space 2} .0070069{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4} -.011819{col 67}{space 3} .0156496
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .9136526{col 26}{space 2} .0214545{col 37}{space 1}   42.59{col 46}{space 3}0.000{col 54}{space 4} .8715994{col 67}{space 3} .9557058
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0139061{col 26}{space 2} .0079675{col 37}{space 1}    1.75{col 46}{space 3}0.081{col 54}{space 4} -.001711{col 67}{space 3} .0295232
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}  .006497{col 26}{space 2} .0019439{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0026869{col 67}{space 3} .0103072
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0010797{col 26}{space 2} .0002681{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} .0005541{col 67}{space 3} .0016052
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0005439{col 26}{space 2} .0001602{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 54}{space 4} .0002299{col 67}{space 3}  .000858
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}  .009235{col 26}{space 2} .0014873{col 37}{space 1}    6.21{col 46}{space 3}0.000{col 54}{space 4} .0063197{col 67}{space 3} .0121503
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0029673{col 26}{space 2} .0009058{col 37}{space 1}    3.28{col 46}{space 3}0.001{col 54}{space 4} .0011917{col 67}{space 3} .0047428
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0005363{col 26}{space 2} .0003571{col 37}{space 1}    1.50{col 46}{space 3}0.133{col 54}{space 4}-.0001636{col 67}{space 3} .0012362
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} .0002566{col 26}{space 2} .0001233{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0000148{col 67}{space 3} .0004983
{txt}dum_Trained2 {c |}{col 14}{res}{space 2}-.0031069{col 26}{space 2} .0008374{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-.0047482{col 67}{space 3}-.0014656
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0002042{col 26}{space 2} .0004635{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-.0011127{col 67}{space 3} .0007043
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0048192{col 26}{space 2} .0019262{col 37}{space 1}   -2.50{col 46}{space 3}0.012{col 54}{space 4}-.0085949{col 67}{space 3}-.0010436
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0054129{col 26}{space 2} .0042044{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.0028282{col 67}{space 3}  .013654
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}  .024989{col 26}{space 2} .0021681{col 37}{space 1}   11.53{col 46}{space 3}0.000{col 54}{space 4} .0207393{col 67}{space 3} .0292386
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0536956{col 26}{space 2} .0039434{col 37}{space 1}  -13.62{col 46}{space 3}0.000{col 54}{space 4}-.0614251{col 67}{space 3}-.0459662
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0011656{col 26}{space 2}  .000399{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.0019477{col 67}{space 3}-.0003836
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0022792{col 26}{space 2} .0011919{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.0046155{col 67}{space 3} .0000571
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0017623{col 26}{space 2} .0012703{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-.0007276{col 67}{space 3} .0042522
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0007315{col 26}{space 2} .0359475{col 37}{space 1}   -0.02{col 46}{space 3}0.984{col 54}{space 4}-.0711926{col 67}{space 3} .0697296
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0017078{col 26}{space 2} .0032431{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-.0046491{col 67}{space 3} .0080646
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0006631{col 26}{space 2} .0007304{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.0007685{col 67}{space 3} .0020947
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0000827{col 26}{space 2} .0003794{col 37}{space 1}   -0.22{col 46}{space 3}0.828{col 54}{space 4}-.0008264{col 67}{space 3} .0006611
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0501719{col 26}{space 2} .0165818{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 54}{space 4} .0176697{col 67}{space 3} .0826742
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0116304{col 26}{space 2}  .004152{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0034921{col 67}{space 3} .0197687
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0007732{col 26}{space 2} .0010313{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.0027946{col 67}{space 3} .0012481
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} .0000495{col 26}{space 2} .0000359{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0000209{col 67}{space 3}   .00012
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0879023{col 26}{space 2} .0089153{col 37}{space 1}    9.86{col 46}{space 3}0.000{col 54}{space 4} .0704273{col 67}{space 3} .1053773
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0450839{col 26}{space 2} .0057493{col 37}{space 1}    7.84{col 46}{space 3}0.000{col 54}{space 4} .0338146{col 67}{space 3} .0563532
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .1525363{col 26}{space 2}  .015224{col 37}{space 1}   10.02{col 46}{space 3}0.000{col 54}{space 4} .1226956{col 67}{space 3} .1823771
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .1068721{col 26}{space 2} .0160268{col 37}{space 1}    6.67{col 46}{space 3}0.000{col 54}{space 4} .0754578{col 67}{space 3} .1382864
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}-.0260313{col 26}{space 2} .0400046{col 37}{space 1}   -0.65{col 46}{space 3}0.515{col 54}{space 4}-.1044447{col 67}{space 3} .0523821
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0469143{col 26}{space 2} .0076682{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4}-.0619447{col 67}{space 3}-.0318838
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0052625{col 26}{space 2} .0010278{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4}-.0072771{col 67}{space 3}-.0032478
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0085087{col 26}{space 2} .0634361{col 37}{space 1}    0.13{col 46}{space 3}0.893{col 54}{space 4}-.1158331{col 67}{space 3} .1328505
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0062135{col 26}{space 2} .0397461{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-.0841203{col 67}{space 3} .0716934
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5345355{col 26}{space 2} .0667712{col 37}{space 1}    8.01{col 46}{space 3}0.000{col 54}{space 4} .4036565{col 67}{space 3} .6654145
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- 8.4: Blinder-Oaxaca: Urban Self-Employed (Pooled) ---"
{res}--- 8.4: Blinder-Oaxaca: Urban Self-Employed (Pooled) ---
{txt}
{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 2 & Occupation == 1 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 6:6}{txt}{col 48}{lalign 15:Number of obs}{col 63} = {res}{ralign 13:217,969}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 6:14,652}{txt}{col 48}{lalign 15:Population size}{col 63} = {res}{ralign 13:1,486,490,661}
{txt}{col 48}{lalign 15:Design df}{col 63} = {res}{ralign 13:14,646}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}   189,032
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}    28,937

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.662512{col 26}{space 2} .0068638{col 37}{space 1} 1407.74{col 46}{space 3}0.000{col 54}{space 4} 9.649058{col 67}{space 3} 9.675966
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.646439{col 26}{space 2} .0265787{col 37}{space 1}  325.31{col 46}{space 3}0.000{col 54}{space 4} 8.594341{col 67}{space 3} 8.698537
{txt}{space 2}difference {c |}{col 14}{res}{space 2} 1.016073{col 26}{space 2} .0268961{col 37}{space 1}   37.78{col 46}{space 3}0.000{col 54}{space 4} .9633533{col 67}{space 3} 1.068793
{txt}{space 3}explained {c |}{col 14}{res}{space 2}  .013723{col 26}{space 2} .0116764{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0091642{col 67}{space 3} .0366102
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2}  1.00235{col 26}{space 2} .0289099{col 37}{space 1}   34.67{col 46}{space 3}0.000{col 54}{space 4} .9456829{col 67}{space 3} 1.059017
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0207981{col 26}{space 2}  .003668{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .0136083{col 67}{space 3} .0279878
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0251459{col 26}{space 2} .0065888{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .0122309{col 67}{space 3} .0380608
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0025517{col 26}{space 2}  .001124{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0003486{col 67}{space 3} .0047548
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0004856{col 26}{space 2} .0013829{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4} -.002225{col 67}{space 3} .0031962
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0059657{col 26}{space 2}  .001487{col 37}{space 1}    4.01{col 46}{space 3}0.000{col 54}{space 4}  .003051{col 67}{space 3} .0088803
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0000973{col 26}{space 2} .0004524{col 37}{space 1}    0.22{col 46}{space 3}0.830{col 54}{space 4}-.0007895{col 67}{space 3}  .000984
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0000575{col 26}{space 2} .0001859{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-.0004219{col 67}{space 3} .0003069
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}-2.44e-06{col 26}{space 2} 7.56e-06{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-.0000173{col 67}{space 3} .0000124
{txt}dum_Trained2 {c |}{col 14}{res}{space 2}-.0027812{col 26}{space 2} .0011516{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-.0050385{col 67}{space 3}-.0005239
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0008069{col 26}{space 2} .0013936{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-.0019247{col 67}{space 3} .0035385
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0003687{col 26}{space 2} .0006125{col 37}{space 1}    0.60{col 46}{space 3}0.547{col 54}{space 4}-.0008318{col 67}{space 3} .0015693
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0029994{col 26}{space 2} .0016554{col 37}{space 1}    1.81{col 46}{space 3}0.070{col 54}{space 4}-.0002453{col 67}{space 3} .0062441
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0501925{col 26}{space 2} .0046395{col 37}{space 1}   10.82{col 46}{space 3}0.000{col 54}{space 4} .0410985{col 67}{space 3} .0592866
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0881736{col 26}{space 2}  .009901{col 37}{space 1}   -8.91{col 46}{space 3}0.000{col 54}{space 4}-.1075809{col 67}{space 3}-.0687663
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0046065{col 26}{space 2} .0015337{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-.0076128{col 67}{space 3}-.0016002
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0002983{col 26}{space 2} .0002742{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.0008357{col 67}{space 3} .0002392
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0002309{col 26}{space 2} .0002426{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.0002447{col 67}{space 3} .0007065
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .1144817{col 26}{space 2} .0368785{col 37}{space 1}    3.10{col 46}{space 3}0.002{col 54}{space 4} .0421953{col 67}{space 3} .1867681
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0404488{col 26}{space 2} .0187739{col 37}{space 1}   -2.15{col 46}{space 3}0.031{col 54}{space 4}-.0772479{col 67}{space 3}-.0036497
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0022786{col 26}{space 2} .0050117{col 37}{space 1}    0.45{col 46}{space 3}0.649{col 54}{space 4} -.007545{col 67}{space 3} .0121022
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0084731{col 26}{space 2}  .003168{col 37}{space 1}   -2.67{col 46}{space 3}0.007{col 54}{space 4}-.0146827{col 67}{space 3}-.0022634
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0032617{col 26}{space 2} .0274299{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0570278{col 67}{space 3} .0505043
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0013182{col 26}{space 2} .0074058{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4}-.0158345{col 67}{space 3}  .013198
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}  .005983{col 26}{space 2} .0028742{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0003492{col 67}{space 3} .0116169
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}-.0000132{col 26}{space 2} .0000503{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4}-.0001119{col 67}{space 3} .0000855
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0639654{col 26}{space 2} .0207667{col 37}{space 1}    3.08{col 46}{space 3}0.002{col 54}{space 4} .0232601{col 67}{space 3} .1046707
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0318989{col 26}{space 2} .0127876{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .0068335{col 67}{space 3} .0569643
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .1836302{col 26}{space 2} .0477411{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .0900516{col 67}{space 3} .2772089
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .1793826{col 26}{space 2} .0406452{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .0997129{col 67}{space 3} .2590522
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}  .059975{col 26}{space 2} .0495068{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-.0370646{col 67}{space 3} .1570146
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0323322{col 26}{space 2} .0142675{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0602983{col 67}{space 3}-.0043661
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0093312{col 26}{space 2} .0028509{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0149194{col 67}{space 3} -.003743
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}  .014566{col 26}{space 2} .0578356{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4} -.098799{col 67}{space 3}  .127931
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0269778{col 26}{space 2} .0331458{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4}-.0379923{col 67}{space 3} .0919478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4143891{col 26}{space 2} .1243977{col 37}{space 1}    3.33{col 46}{space 3}0.001{col 54}{space 4} .1705539{col 67}{space 3} .6582243
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. * STEP 9: STATE-LEVEL COMPARATIVE DECOMPOSITION ---
. 
. display "--- STATE: GUJARAT (state_utcode == 24) ---"
{res}--- STATE: GUJARAT (state_utcode == 24) ---
{txt}
{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 1 & Occupation == 2 & state_utcode == 24 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:5}{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:2,433}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:476}{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:40,012,085}
{txt}{col 51}{lalign 15:Design df}{col 66} = {res}{ralign 10:471}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     2,076
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}       357

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.393136{col 26}{space 2}  .032682{col 37}{space 1}  287.41{col 46}{space 3}0.000{col 54}{space 4} 9.328915{col 67}{space 3} 9.457356
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.956884{col 26}{space 2} .0668196{col 37}{space 1}  134.05{col 46}{space 3}0.000{col 54}{space 4} 8.825583{col 67}{space 3} 9.088185
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .4362516{col 26}{space 2}  .068665{col 37}{space 1}    6.35{col 46}{space 3}0.000{col 54}{space 4} .3013239{col 67}{space 3} .5711793
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0170796{col 26}{space 2} .0416486{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.0647605{col 67}{space 3} .0989197
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2}  .419172{col 26}{space 2} .0682912{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} .2849788{col 67}{space 3} .5533652
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}  .010237{col 26}{space 2} .0089006{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.0072528{col 67}{space 3} .0277268
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0341701{col 26}{space 2} .0296871{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-.0925056{col 67}{space 3} .0241655
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0077307{col 26}{space 2} .0065594{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.0051586{col 67}{space 3}   .02062
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0009213{col 26}{space 2} .0034011{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-.0076044{col 67}{space 3} .0057619
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0014361{col 26}{space 2} .0030492{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-.0074278{col 67}{space 3} .0045555
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0018701{col 26}{space 2} .0045536{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-.0070779{col 67}{space 3} .0108181
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0001652{col 26}{space 2} .0071232{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.0138321{col 67}{space 3} .0141624
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0091397{col 26}{space 2}  .012913{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.0162346{col 67}{space 3}  .034514
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0004267{col 26}{space 2} .0015822{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-.0035357{col 67}{space 3} .0026822
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} -.000301{col 26}{space 2} .0017811{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4} -.003801{col 67}{space 3}  .003199
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0219169{col 26}{space 2} .0140168{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0056262{col 67}{space 3} .0494601
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}  .003316{col 26}{space 2} .0087854{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-.0139474{col 67}{space 3} .0205794
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0014741{col 26}{space 2} .0145356{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.0300367{col 67}{space 3} .0270886
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0002392{col 26}{space 2} .0008687{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4}-.0014678{col 67}{space 3} .0019462
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0029683{col 26}{space 2} .0084819{col 37}{space 1}   -0.35{col 46}{space 3}0.727{col 54}{space 4}-.0196353{col 67}{space 3} .0136987
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0041623{col 26}{space 2}  .009826{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4} -.015146{col 67}{space 3} .0234705
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} -.296301{col 26}{space 2} .1105004{col 37}{space 1}   -2.68{col 46}{space 3}0.008{col 54}{space 4}-.5134358{col 67}{space 3}-.0791662
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.1073619{col 26}{space 2} .0527529{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4} -.211022{col 67}{space 3}-.0037018
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0124687{col 26}{space 2} .0184234{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4} -.048671{col 67}{space 3} .0237336
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0212464{col 26}{space 2} .0158612{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.0099209{col 67}{space 3} .0524138
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0706025{col 26}{space 2} .0586878{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.0447198{col 67}{space 3} .1859248
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .1065635{col 26}{space 2} .0390297{col 37}{space 1}    2.73{col 46}{space 3}0.007{col 54}{space 4} .0298697{col 67}{space 3} .1832574
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0276908{col 26}{space 2} .0230516{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-.0729874{col 67}{space 3} .0176059
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0182083{col 26}{space 2} .0354904{col 37}{space 1}    0.51{col 46}{space 3}0.608{col 54}{space 4}-.0515307{col 67}{space 3} .0879474
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0033067{col 26}{space 2} .0118888{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0266683{col 67}{space 3} .0200549
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0228401{col 26}{space 2} .0459292{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-.0674114{col 67}{space 3} .1130916
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0176163{col 26}{space 2}  .040224{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4} -.096657{col 67}{space 3} .0614244
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0641817{col 26}{space 2} .0727044{col 37}{space 1}    0.88{col 46}{space 3}0.378{col 54}{space 4}-.0786834{col 67}{space 3} .2070468
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0015288{col 26}{space 2} .0220101{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-.0447789{col 67}{space 3} .0417212
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0052454{col 26}{space 2} .0049039{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-.0148817{col 67}{space 3} .0043909
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0010651{col 26}{space 2} .2241207{col 37}{space 1}    0.00{col 46}{space 3}0.996{col 54}{space 4} -.439335{col 67}{space 3} .4414652
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0021114{col 26}{space 2} .1124961{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4} -.218945{col 67}{space 3} .2231678
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5838725{col 26}{space 2} .2128645{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .1655909{col 67}{space 3} 1.002154
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 2 & Occupation == 2 & state_utcode == 24 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 2 has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:5}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:16,234}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:886}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:207,809,059}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:881}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}    13,495
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     2,739

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.613085{col 26}{space 2} .0220309{col 37}{space 1}  436.35{col 46}{space 3}0.000{col 54}{space 4} 9.569846{col 67}{space 3} 9.656325
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2}  9.22542{col 26}{space 2} .0590431{col 37}{space 1}  156.25{col 46}{space 3}0.000{col 54}{space 4} 9.109539{col 67}{space 3} 9.341302
{txt}{space 2}difference {c |}{col 14}{res}{space 2}  .387665{col 26}{space 2} .0606283{col 37}{space 1}    6.39{col 46}{space 3}0.000{col 54}{space 4} .2686723{col 67}{space 3} .5066577
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0068775{col 26}{space 2} .0318438{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4} -.055621{col 67}{space 3}  .069376
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .3807875{col 26}{space 2} .0451269{col 37}{space 1}    8.44{col 46}{space 3}0.000{col 54}{space 4} .2922187{col 67}{space 3} .4693564
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0426696{col 26}{space 2} .0198864{col 37}{space 1}    2.15{col 46}{space 3}0.032{col 54}{space 4} .0036393{col 67}{space 3} .0816998
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0793715{col 26}{space 2} .0356215{col 37}{space 1}   -2.23{col 46}{space 3}0.026{col 54}{space 4}-.1492844{col 67}{space 3}-.0094585
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0081972{col 26}{space 2} .0052301{col 37}{space 1}    1.57{col 46}{space 3}0.117{col 54}{space 4}-.0020677{col 67}{space 3} .0184621
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} -.002066{col 26}{space 2} .0046439{col 37}{space 1}   -0.44{col 46}{space 3}0.657{col 54}{space 4}-.0111805{col 67}{space 3} .0070485
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0030108{col 26}{space 2} .0038494{col 37}{space 1}    0.78{col 46}{space 3}0.434{col 54}{space 4}-.0045443{col 67}{space 3} .0105658
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0003394{col 26}{space 2} .0008561{col 37}{space 1}   -0.40{col 46}{space 3}0.692{col 54}{space 4}-.0020197{col 67}{space 3} .0013408
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0013998{col 26}{space 2} .0011875{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-.0037304{col 67}{space 3} .0009308
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} .0001272{col 26}{space 2} .0001288{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0001257{col 67}{space 3} .0003801
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0120211{col 26}{space 2} .0053418{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4}  .001537{col 67}{space 3} .0225051
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0007545{col 26}{space 2} .0031749{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-.0069857{col 67}{space 3} .0054768
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} -.002012{col 26}{space 2} .0044002{col 37}{space 1}   -0.46{col 46}{space 3}0.648{col 54}{space 4}-.0106482{col 67}{space 3} .0066241
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0093285{col 26}{space 2} .0077251{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4}-.0058332{col 67}{space 3} .0244902
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0384068{col 26}{space 2}  .013995{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0109394{col 67}{space 3} .0658742
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} -.021194{col 26}{space 2} .0082434{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4} -.037373{col 67}{space 3}-.0050149
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0001233{col 26}{space 2} .0011977{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4}-.0022275{col 67}{space 3}  .002474
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} 5.36e-06{col 26}{space 2} .0001207{col 37}{space 1}    0.04{col 46}{space 3}0.965{col 54}{space 4}-.0002316{col 67}{space 3} .0002423
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}  .000125{col 26}{space 2}   .00052{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-.0008956{col 67}{space 3} .0011456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .1559465{col 26}{space 2}  .105461{col 37}{space 1}    1.48{col 46}{space 3}0.140{col 54}{space 4}-.0510376{col 67}{space 3} .3629305
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0300879{col 26}{space 2} .0531779{col 37}{space 1}    0.57{col 46}{space 3}0.572{col 54}{space 4}-.0742823{col 67}{space 3}  .134458
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0143834{col 26}{space 2} .0091508{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.0323433{col 67}{space 3} .0035764
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0003078{col 26}{space 2} .0108258{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-.0215552{col 67}{space 3} .0209395
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .1217303{col 26}{space 2} .0517154{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0202304{col 67}{space 3} .2232301
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0041529{col 26}{space 2} .0102663{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.0159964{col 67}{space 3} .0243021
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} -.000938{col 26}{space 2} .0008687{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.0026429{col 67}{space 3}  .000767
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} 2.70e-06{col 26}{space 2}  .000015{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-.0000268{col 67}{space 3} .0000322
{txt}dum_Trained2 {c |}{col 14}{res}{space 2}-.0648629{col 26}{space 2} .0203014{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.1047077{col 67}{space 3}-.0250181
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0163921{col 26}{space 2} .0179265{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4}-.0515757{col 67}{space 3} .0187915
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} -.122038{col 26}{space 2} .0643667{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.2483681{col 67}{space 3}  .004292
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.1078437{col 26}{space 2} .0511925{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.2083171{col 67}{space 3}-.0073703
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .1237771{col 26}{space 2} .0460772{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} .0333431{col 67}{space 3}  .214211
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} .0187948{col 26}{space 2} .0101223{col 37}{space 1}    1.86{col 46}{space 3}0.064{col 54}{space 4}-.0010718{col 67}{space 3} .0386614
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0085659{col 26}{space 2} .0055414{col 37}{space 1}    1.55{col 46}{space 3}0.123{col 54}{space 4}  -.00231{col 67}{space 3} .0194418
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0095847{col 26}{space 2} .1084809{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-.2224959{col 67}{space 3} .2033264
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0130287{col 26}{space 2} .0610994{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.1329461{col 67}{space 3} .1068887
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .267109{col 26}{space 2} .2354772{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.1950528{col 67}{space 3} .7292708
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 1 & Occupation == 1 & state_utcode == 24 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 2 has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:5}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:6,486}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:593}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:100,661,600}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:588}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     5,007
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     1,479

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.299911{col 26}{space 2} .0202658{col 37}{space 1}  458.90{col 46}{space 3}0.000{col 54}{space 4} 9.260109{col 67}{space 3} 9.339713
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.385347{col 26}{space 2} .0344405{col 37}{space 1}  243.47{col 46}{space 3}0.000{col 54}{space 4} 8.317705{col 67}{space 3} 8.452988
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .9145643{col 26}{space 2} .0357056{col 37}{space 1}   25.61{col 46}{space 3}0.000{col 54}{space 4} .8444383{col 67}{space 3} .9846903
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0065404{col 26}{space 2} .0190537{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4}-.0308811{col 67}{space 3} .0439619
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .9080239{col 26}{space 2} .0352809{col 37}{space 1}   25.74{col 46}{space 3}0.000{col 54}{space 4} .8387319{col 67}{space 3} .9773159
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0090538{col 26}{space 2} .0115065{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4} -.013545{col 67}{space 3} .0316527
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0099294{col 26}{space 2} .0032092{col 37}{space 1}    3.09{col 46}{space 3}0.002{col 54}{space 4} .0036265{col 67}{space 3} .0162323
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0014253{col 26}{space 2} .0013108{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.0039997{col 67}{space 3} .0011491
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0004286{col 26}{space 2} .0007343{col 37}{space 1}   -0.58{col 46}{space 3}0.560{col 54}{space 4}-.0018707{col 67}{space 3} .0010136
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0037767{col 26}{space 2} .0023605{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-.0008592{col 67}{space 3} .0084127
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0046569{col 26}{space 2} .0032607{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4} -.011061{col 67}{space 3} .0017471
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} -.000628{col 26}{space 2} .0024937{col 37}{space 1}   -0.25{col 46}{space 3}0.801{col 54}{space 4}-.0055256{col 67}{space 3} .0042696
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}  .000049{col 26}{space 2} .0000491{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.0000474{col 67}{space 3} .0001454
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0097704{col 26}{space 2} .0037996{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .0023079{col 67}{space 3} .0172329
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0014826{col 26}{space 2}  .002328{col 37}{space 1}    0.64{col 46}{space 3}0.524{col 54}{space 4}-.0030896{col 67}{space 3} .0060549
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} -.054296{col 26}{space 2}  .010376{col 37}{space 1}   -5.23{col 46}{space 3}0.000{col 54}{space 4}-.0746744{col 67}{space 3}-.0339175
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0429971{col 26}{space 2} .0101633{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .0230363{col 67}{space 3}  .062958
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0067474{col 26}{space 2} .0033979{col 37}{space 1}    1.99{col 46}{space 3}0.048{col 54}{space 4} .0000739{col 67}{space 3} .0134209
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0177193{col 26}{space 2} .0068612{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.0311946{col 67}{space 3}-.0042439
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0020466{col 26}{space 2} .0010333{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0000172{col 67}{space 3}  .004076
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0011514{col 26}{space 2}  .001914{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.0026078{col 67}{space 3} .0049106
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}  -.00131{col 26}{space 2} .0021955{col 37}{space 1}   -0.60{col 46}{space 3}0.551{col 54}{space 4}-.0056221{col 67}{space 3}  .003002
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0237368{col 26}{space 2} .0445136{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-.0636881{col 67}{space 3} .1111617
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0048915{col 26}{space 2} .0067142{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.0180782{col 67}{space 3} .0082951
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0013064{col 26}{space 2} .0005421{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-.0023711{col 67}{space 3}-.0002417
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0002093{col 26}{space 2} .0004171{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 54}{space 4}-.0010285{col 67}{space 3} .0006098
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0668843{col 26}{space 2} .0600011{col 37}{space 1}    1.11{col 46}{space 3}0.265{col 54}{space 4}-.0509583{col 67}{space 3} .1847269
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0418312{col 26}{space 2} .0199429{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0026632{col 67}{space 3} .0809992
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0027102{col 26}{space 2} .0043214{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4} -.005777{col 67}{space 3} .0111974
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2} 2.27e-06{col 26}{space 2} 2.46e-06{col 37}{space 1}    0.92{col 46}{space 3}0.356{col 54}{space 4}-2.56e-06{col 67}{space 3} 7.10e-06
{txt}dum_Trained2 {c |}{col 14}{res}{space 2} .0595368{col 26}{space 2} .0151203{col 37}{space 1}    3.94{col 46}{space 3}0.000{col 54}{space 4} .0298404{col 67}{space 3} .0892332
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} -.000462{col 26}{space 2}  .009093{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.0183206{col 67}{space 3} .0173967
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0197223{col 26}{space 2} .0489981{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4} -.115955{col 67}{space 3} .0765103
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0000747{col 26}{space 2} .0178994{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.0352291{col 67}{space 3} .0350798
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .1996525{col 26}{space 2} .1525689{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.0999939{col 67}{space 3} .4992989
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} .0054038{col 26}{space 2} .0193629{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4} -.032625{col 67}{space 3} .0434327
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0005816{col 26}{space 2} .0005766{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.0005508{col 67}{space 3} .0017141
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.3310025{col 26}{space 2} .1449669{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.6157186{col 67}{space 3}-.0462865
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .1908671{col 26}{space 2} .0858174{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0223212{col 67}{space 3} .3594131
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .674486{col 26}{space 2} .2256251{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} .2313568{col 67}{space 3} 1.117615
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 2 & Occupation == 1 & state_utcode == 24 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:5}{txt}{col 50}{lalign 15:Number of obs}{col 65} = {res}{ralign 11:9,831}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:841}{txt}{col 50}{lalign 15:Population size}{col 65} = {res}{ralign 11:114,259,244}
{txt}{col 50}{lalign 15:Design df}{col 65} = {res}{ralign 11:836}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     8,673
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     1,158

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.785862{col 26}{space 2} .0259439{col 37}{space 1}  377.19{col 46}{space 3}0.000{col 54}{space 4} 9.734939{col 67}{space 3} 9.836785
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.477094{col 26}{space 2} .0914317{col 37}{space 1}   92.72{col 46}{space 3}0.000{col 54}{space 4} 8.297632{col 67}{space 3} 8.656557
{txt}{space 2}difference {c |}{col 14}{res}{space 2} 1.308767{col 26}{space 2} .0938813{col 37}{space 1}   13.94{col 46}{space 3}0.000{col 54}{space 4} 1.124497{col 67}{space 3} 1.493038
{txt}{space 3}explained {c |}{col 14}{res}{space 2} .0108659{col 26}{space 2} .0348274{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-.0574936{col 67}{space 3} .0792254
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} 1.297902{col 26}{space 2} .0802723{col 37}{space 1}   16.17{col 46}{space 3}0.000{col 54}{space 4} 1.140343{col 67}{space 3} 1.455461
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0369942{col 26}{space 2}  .017377{col 37}{space 1}    2.13{col 46}{space 3}0.034{col 54}{space 4} .0028867{col 67}{space 3} .0711018
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0182412{col 26}{space 2} .0296866{col 37}{space 1}   -0.61{col 46}{space 3}0.539{col 54}{space 4}-.0765102{col 67}{space 3} .0400278
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0055385{col 26}{space 2} .0090195{col 37}{space 1}   -0.61{col 46}{space 3}0.539{col 54}{space 4}-.0232421{col 67}{space 3} .0121651
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0017402{col 26}{space 2} .0044428{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.0069802{col 67}{space 3} .0104607
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}  .012854{col 26}{space 2} .0074738{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0018156{col 67}{space 3} .0275237
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0008127{col 26}{space 2} .0057772{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.0121522{col 67}{space 3} .0105269
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0047496{col 26}{space 2} .0070103{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-.0090104{col 67}{space 3} .0185095
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2}-.0047694{col 26}{space 2} .0061963{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.0169316{col 67}{space 3} .0073928
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}   .00082{col 26}{space 2} .0020103{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.0031258{col 67}{space 3} .0047659
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0029984{col 26}{space 2} .0062023{col 37}{space 1}   -0.48{col 46}{space 3}0.629{col 54}{space 4}-.0151723{col 67}{space 3} .0091756
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0050777{col 26}{space 2} .0144305{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4}-.0232466{col 67}{space 3} .0334021
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0273521{col 26}{space 2} .0113402{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0050935{col 67}{space 3} .0496108
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0441467{col 26}{space 2} .0187608{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0809706{col 67}{space 3}-.0073229
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0011578{col 26}{space 2} .0022183{col 37}{space 1}   -0.52{col 46}{space 3}0.602{col 54}{space 4}-.0055118{col 67}{space 3} .0031962
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0010357{col 26}{space 2} .0019982{col 37}{space 1}   -0.52{col 46}{space 3}0.604{col 54}{space 4}-.0049578{col 67}{space 3} .0028865
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0000216{col 26}{space 2} .0005556{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.0011122{col 67}{space 3} .0010689
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0687388{col 26}{space 2} .1623251{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-.2498737{col 67}{space 3} .3873514
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0753478{col 26}{space 2} .0648538{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-.2026432{col 67}{space 3} .0519477
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0528703{col 26}{space 2} .0265106{col 37}{space 1}   -1.99{col 46}{space 3}0.046{col 54}{space 4}-.1049055{col 67}{space 3} -.000835
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0299155{col 26}{space 2} .0179533{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-.0651544{col 67}{space 3} .0053233
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.1013422{col 26}{space 2} .0815187{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-.2613477{col 67}{space 3} .0586632
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0095226{col 26}{space 2}  .029117{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.0666737{col 67}{space 3} .0476285
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}  .005485{col 26}{space 2} .0073263{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4}-.0088951{col 67}{space 3} .0198652
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0099028{col 26}{space 2} .0562415{col 37}{space 1}    0.18{col 46}{space 3}0.860{col 54}{space 4}-.1004884{col 67}{space 3}  .120294
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0195743{col 26}{space 2} .0184546{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}-.0166485{col 67}{space 3} .0557972
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .1662632{col 26}{space 2} .1192966{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4} -.067893{col 67}{space 3} .4004193
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .3157859{col 26}{space 2} .1582314{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0052083{col 67}{space 3} .6263635
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0062665{col 26}{space 2} .1289108{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-.2467603{col 67}{space 3} .2592934
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0631421{col 26}{space 2} .0258338{col 37}{space 1}   -2.44{col 46}{space 3}0.015{col 54}{space 4}-.1138487{col 67}{space 3}-.0124354
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0114434{col 26}{space 2} .0070646{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.0253099{col 67}{space 3} .0024231
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.1248271{col 26}{space 2}  .158731{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-.4363853{col 67}{space 3}  .186731
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .1691316{col 26}{space 2} .0890567{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0056694{col 67}{space 3} .3439327
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.005164{col 26}{space 2} .3705089{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .2779271{col 67}{space 3} 1.732401
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. display "--- STATE: MANIPUR (state_utcode == 14) ---"
{res}--- STATE: MANIPUR (state_utcode == 14) ---
{txt}
{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 1 & Occupation == 2 & state_utcode == 14 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:2}{txt}{col 52}{lalign 15:Number of obs}{col 67} = {res}{ralign 9:1,506}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:373}{txt}{col 52}{lalign 15:Population size}{col 67} = {res}{ralign 9:2,569,497}
{txt}{col 52}{lalign 15:Design df}{col 67} = {res}{ralign 9:371}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     1,276
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}       230

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.976695{col 26}{space 2} .0318666{col 37}{space 1}  313.08{col 46}{space 3}0.000{col 54}{space 4} 9.914033{col 67}{space 3} 10.03936
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 9.655224{col 26}{space 2} .0974191{col 37}{space 1}   99.11{col 46}{space 3}0.000{col 54}{space 4} 9.463661{col 67}{space 3} 9.846787
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .3214711{col 26}{space 2} .1019635{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .1209722{col 67}{space 3} .5219699
{txt}{space 3}explained {c |}{col 14}{res}{space 2}-.0766054{col 26}{space 2} .0601405{col 37}{space 1}   -1.27{col 46}{space 3}0.204{col 54}{space 4}-.1948644{col 67}{space 3} .0416536
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .3980765{col 26}{space 2} .1015483{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4}  .198394{col 67}{space 3} .5977589
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0826802{col 26}{space 2} .0514719{col 37}{space 1}    1.61{col 46}{space 3}0.109{col 54}{space 4} -.018533{col 67}{space 3} .1838935
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.1570591{col 26}{space 2} .0591518{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-.2733741{col 67}{space 3}-.0407442
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0020524{col 26}{space 2} .0032527{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.0084484{col 67}{space 3} .0043435
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0005198{col 26}{space 2} .0018663{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0041897{col 67}{space 3} .0031501
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0147194{col 26}{space 2}  .012971{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.0107866{col 67}{space 3} .0402254
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0007741{col 26}{space 2} .0094009{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-.0177116{col 67}{space 3} .0192599
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0017131{col 26}{space 2} .0025618{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-.0067506{col 67}{space 3} .0033245
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0028333{col 26}{space 2} .0101266{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.0170794{col 67}{space 3} .0227461
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0017894{col 26}{space 2} .0083567{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.0182218{col 67}{space 3} .0146429
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.0016566{col 26}{space 2} .0103456{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-.0220001{col 67}{space 3} .0186868
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0025802{col 26}{space 2} .0080629{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-.0184349{col 67}{space 3} .0132745
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .1316532{col 26}{space 2} .0417377{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0495812{col 67}{space 3} .2137253
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.1362778{col 26}{space 2} .0551837{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-.2447899{col 67}{space 3}-.0277657
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0056168{col 26}{space 2} .0071845{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-.0197442{col 67}{space 3} .0085106
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.0002301{col 26}{space 2} .0021015{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.0043623{col 67}{space 3} .0039022
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0002297{col 26}{space 2} .0017343{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-.0031807{col 67}{space 3}   .00364
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0049823{col 26}{space 2} .1200642{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.2311094{col 67}{space 3}  .241074
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.4739037{col 26}{space 2} .3078544{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-1.079262{col 67}{space 3} .1314547
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0022788{col 26}{space 2} .0072897{col 37}{space 1}   -0.31{col 46}{space 3}0.755{col 54}{space 4}-.0166132{col 67}{space 3} .0120555
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0061909{col 26}{space 2} .0084734{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}-.0228528{col 67}{space 3}  .010471
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.1121573{col 26}{space 2} .1762144{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-.4586616{col 67}{space 3} .2343471
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0662509{col 26}{space 2} .0473007{col 37}{space 1}   -1.40{col 46}{space 3}0.162{col 54}{space 4} -.159262{col 67}{space 3} .0267603
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}  .004645{col 26}{space 2} .0187453{col 37}{space 1}    0.25{col 46}{space 3}0.804{col 54}{space 4}-.0322154{col 67}{space 3} .0415054
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0538319{col 26}{space 2} .0722516{col 37}{space 1}    0.75{col 46}{space 3}0.457{col 54}{space 4} -.088242{col 67}{space 3} .1959059
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2}-.0034271{col 26}{space 2}  .003023{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-.0093713{col 67}{space 3} .0025172
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0279424{col 26}{space 2} .0644391{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-.0987693{col 67}{space 3} .1546541
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0744341{col 26}{space 2} .0581795{col 37}{space 1}    1.28{col 46}{space 3}0.202{col 54}{space 4}-.0399689{col 67}{space 3} .1888371
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .2706973{col 26}{space 2} .1549659{col 37}{space 1}    1.75{col 46}{space 3}0.081{col 54}{space 4}-.0340244{col 67}{space 3} .5754191
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} .0116759{col 26}{space 2} .0246274{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}-.0367508{col 67}{space 3} .0601027
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0066172{col 26}{space 2} .0056633{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-.0177535{col 67}{space 3}  .004519
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}-.3028562{col 26}{space 2}  .471572{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-1.230145{col 67}{space 3} .6244329
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .2666019{col 26}{space 2}  .284033{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.2919145{col 67}{space 3} .8251183
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6569477{col 26}{space 2}  .416768{col 37}{space 1}    1.58{col 46}{space 3}0.116{col 54}{space 4}-.1625761{col 67}{space 3} 1.476472
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnRegWage $oaxaca_vars if Sector == 2 & Occupation == 2 & state_utcode == 14 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:2}{txt}{col 52}{lalign 15:Number of obs}{col 67} = {res}{ralign 9:7,031}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:431}{txt}{col 52}{lalign 15:Population size}{col 67} = {res}{ralign 9:4,478,061}
{txt}{col 52}{lalign 15:Design df}{col 67} = {res}{ralign 9:429}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     5,266
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     1,765

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}   lnRegWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.957961{col 26}{space 2} .0280471{col 37}{space 1}  355.04{col 46}{space 3}0.000{col 54}{space 4} 9.902834{col 67}{space 3} 10.01309
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 9.778561{col 26}{space 2} .0748729{col 37}{space 1}  130.60{col 46}{space 3}0.000{col 54}{space 4} 9.631397{col 67}{space 3} 9.925724
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .1793999{col 26}{space 2} .0792692{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .0235956{col 67}{space 3} .3352042
{txt}{space 3}explained {c |}{col 14}{res}{space 2}-.0464345{col 26}{space 2} .0423707{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-.1297145{col 67}{space 3} .0368456
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .2258343{col 26}{space 2} .0660752{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4}  .095963{col 67}{space 3} .3557057
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0182605{col 26}{space 2} .0551585{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4} -.126675{col 67}{space 3} .0901539
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0295312{col 26}{space 2} .0521302{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-.1319937{col 67}{space 3} .0729313
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0121074{col 26}{space 2} .0075431{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-.0269333{col 67}{space 3} .0027186
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0501086{col 26}{space 2} .0280936{col 37}{space 1}   -1.78{col 46}{space 3}0.075{col 54}{space 4}-.1053268{col 67}{space 3} .0051097
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0006109{col 26}{space 2} .0044544{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-.0093661{col 67}{space 3} .0081443
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0004481{col 26}{space 2} .0053938{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-.0101535{col 67}{space 3} .0110497
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0034379{col 26}{space 2} .0033785{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-.0100783{col 67}{space 3} .0032026
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} -.000151{col 26}{space 2} .0027633{col 37}{space 1}   -0.05{col 46}{space 3}0.956{col 54}{space 4}-.0055824{col 67}{space 3} .0052804
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0014288{col 26}{space 2} .0039147{col 37}{space 1}    0.36{col 46}{space 3}0.715{col 54}{space 4}-.0062657{col 67}{space 3} .0091232
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0023557{col 26}{space 2} .0076952{col 37}{space 1}    0.31{col 46}{space 3}0.760{col 54}{space 4}-.0127694{col 67}{space 3} .0174807
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0001762{col 26}{space 2}  .001084{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-.0023068{col 67}{space 3} .0019544
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}  .085207{col 26}{space 2} .0241059{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .0378267{col 67}{space 3} .1325873
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0232969{col 26}{space 2}  .011598{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-.0460928{col 67}{space 3}-.0005009
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0012745{col 26}{space 2} .0021286{col 37}{space 1}    0.60{col 46}{space 3}0.550{col 54}{space 4}-.0029094{col 67}{space 3} .0054583
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0030432{col 26}{space 2} .0031292{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.0031072{col 67}{space 3} .0091936
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0025112{col 26}{space 2} .0029439{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-.0082975{col 67}{space 3} .0032752
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .2220557{col 26}{space 2} .2424066{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4}-.2543967{col 67}{space 3} .6985082
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}  .118053{col 26}{space 2} .3934945{col 37}{space 1}    0.30{col 46}{space 3}0.764{col 54}{space 4}-.6553641{col 67}{space 3} .8914701
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0173264{col 26}{space 2} .0099585{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-.0368999{col 67}{space 3} .0022471
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0116875{col 26}{space 2} .0147172{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4}-.0172393{col 67}{space 3} .0406144
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}  .012463{col 26}{space 2} .0841731{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}  -.15298{col 67}{space 3}  .177906
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0057027{col 26}{space 2} .0143898{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-.0225806{col 67}{space 3}  .033986
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0033924{col 26}{space 2} .0033955{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-.0032816{col 67}{space 3} .0100663
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0947122{col 26}{space 2} .0482236{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4}-.0000718{col 67}{space 3} .1894962
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0020818{col 26}{space 2} .0090445{col 37}{space 1}    0.23{col 46}{space 3}0.818{col 54}{space 4}-.0156951{col 67}{space 3} .0198588
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2}-.1055546{col 26}{space 2} .0721094{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-.2472863{col 67}{space 3}  .036177
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0607007{col 26}{space 2} .0604077{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4}-.1794327{col 67}{space 3} .0580313
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2}-.1202913{col 26}{space 2} .0932309{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-.3035375{col 67}{space 3} .0629549
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} -.027324{col 26}{space 2} .0108118{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-.0485745{col 67}{space 3}-.0060734
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2} .0032578{col 26}{space 2} .0016508{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4}  .000013{col 67}{space 3} .0065025
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0385068{col 26}{space 2} .1139372{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4}-.1854377{col 67}{space 3} .2624514
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} .0078417{col 26}{space 2} .0696849{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.1291246{col 67}{space 3} .1448081
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0372765{col 26}{space 2} .6672953{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-1.274298{col 67}{space 3} 1.348851
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 1 & Occupation == 1 & state_utcode == 14 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:2}{txt}{col 52}{lalign 15:Number of obs}{col 67} = {res}{ralign 9:5,273}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:423}{txt}{col 52}{lalign 15:Population size}{col 67} = {res}{ralign 9:6,826,457}
{txt}{col 52}{lalign 15:Design df}{col 67} = {res}{ralign 9:421}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     3,996
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     1,277

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.351961{col 26}{space 2} .0175693{col 37}{space 1}  532.29{col 46}{space 3}0.000{col 54}{space 4} 9.317426{col 67}{space 3} 9.386495
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.847403{col 26}{space 2}  .033175{col 37}{space 1}  266.69{col 46}{space 3}0.000{col 54}{space 4} 8.782194{col 67}{space 3} 8.912613
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .5045575{col 26}{space 2} .0316974{col 37}{space 1}   15.92{col 46}{space 3}0.000{col 54}{space 4} .4422527{col 67}{space 3} .5668623
{txt}{space 3}explained {c |}{col 14}{res}{space 2}-.0601489{col 26}{space 2} .0160779{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.0917519{col 67}{space 3}-.0285459
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .5647064{col 26}{space 2} .0349692{col 37}{space 1}   16.15{col 46}{space 3}0.000{col 54}{space 4} .4959704{col 67}{space 3} .6334424
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .0030322{col 26}{space 2} .0025419{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-.0019641{col 67}{space 3} .0080285
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0055383{col 26}{space 2} .0038053{col 37}{space 1}    1.46{col 46}{space 3}0.146{col 54}{space 4}-.0019416{col 67}{space 3} .0130181
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}  .000176{col 26}{space 2} .0002212{col 37}{space 1}    0.80{col 46}{space 3}0.427{col 54}{space 4}-.0002589{col 67}{space 3} .0006109
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} -.000021{col 26}{space 2} .0005244{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.0010516{col 67}{space 3} .0010097
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0019752{col 26}{space 2} .0014666{col 37}{space 1}    1.35{col 46}{space 3}0.179{col 54}{space 4}-.0009075{col 67}{space 3} .0048579
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0000659{col 26}{space 2} .0007516{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 54}{space 4}-.0015433{col 67}{space 3} .0014115
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0006013{col 26}{space 2}  .001155{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4} -.001669{col 67}{space 3} .0028715
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} -.048955{col 26}{space 2}     .009{col 37}{space 1}   -5.44{col 46}{space 3}0.000{col 54}{space 4}-.0666455{col 67}{space 3}-.0312646
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0000451{col 26}{space 2} .0004914{col 37}{space 1}    0.09{col 46}{space 3}0.927{col 54}{space 4}-.0009208{col 67}{space 3} .0010111
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0009963{col 26}{space 2} .0023492{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-.0036213{col 67}{space 3}  .005614
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0002127{col 26}{space 2} .0005365{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-.0008419{col 67}{space 3} .0012674
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0416665{col 26}{space 2}  .009524{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4}  .022946{col 67}{space 3}  .060387
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0619655{col 26}{space 2} .0108738{col 37}{space 1}   -5.70{col 46}{space 3}0.000{col 54}{space 4}-.0833391{col 67}{space 3}-.0405918
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0034077{col 26}{space 2} .0024761{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-.0082748{col 67}{space 3} .0014594
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0000644{col 26}{space 2} .0006414{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.0011963{col 67}{space 3} .0013252
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0000419{col 26}{space 2} .0003861{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4} -.000801{col 67}{space 3} .0007171
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0488477{col 26}{space 2} .0642441{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.1751269{col 67}{space 3} .0774315
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2}-.0033629{col 26}{space 2} .0082415{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4}-.0195625{col 67}{space 3} .0128366
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-7.55e-07{col 26}{space 2} .0000346{col 37}{space 1}   -0.02{col 46}{space 3}0.983{col 54}{space 4}-.0000688{col 67}{space 3} .0000673
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}-.0000631{col 26}{space 2} .0000494{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-.0001602{col 67}{space 3} .0000341
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2}-.0051604{col 26}{space 2} .0357935{col 37}{space 1}   -0.14{col 46}{space 3}0.885{col 54}{space 4}-.0755167{col 67}{space 3} .0651959
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0026427{col 26}{space 2}  .010223{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-.0227372{col 67}{space 3} .0174518
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2}-.0005966{col 26}{space 2}  .000842{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-.0022516{col 67}{space 3} .0010584
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0403493{col 26}{space 2} .0286906{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0160453{col 67}{space 3}  .096744
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0027228{col 26}{space 2} .0028281{col 37}{space 1}    0.96{col 46}{space 3}0.336{col 54}{space 4}-.0028362{col 67}{space 3} .0082817
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .1442559{col 26}{space 2} .0257082{col 37}{space 1}    5.61{col 46}{space 3}0.000{col 54}{space 4} .0937235{col 67}{space 3} .1947883
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0206907{col 26}{space 2} .0080599{col 37}{space 1}    2.57{col 46}{space 3}0.011{col 54}{space 4}  .004848{col 67}{space 3} .0365334
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .1160452{col 26}{space 2} .0458802{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4} .0258623{col 67}{space 3}  .206228
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.0046867{col 26}{space 2} .0091904{col 37}{space 1}   -0.51{col 46}{space 3}0.610{col 54}{space 4}-.0227514{col 67}{space 3} .0133781
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0035452{col 26}{space 2} .0023441{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4}-.0081528{col 67}{space 3} .0010623
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0756476{col 26}{space 2} .1469258{col 37}{space 1}    0.51{col 46}{space 3}0.607{col 54}{space 4}-.2131519{col 67}{space 3}  .364447
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0289635{col 26}{space 2} .0897444{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-.2053664{col 67}{space 3} .1474395
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2628644{col 26}{space 2} .1317407{col 37}{space 1}    2.00{col 46}{space 3}0.047{col 54}{space 4} .0039129{col 67}{space 3} .5218159
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. oaxaca lnSelfWage $oaxaca_vars if Sector == 2 & Occupation == 1 & state_utcode == 14 & (Sex == 1 | Sex == 2), by(Sex) pool detail svy relax
{res}{txt}(model 1 has zero variance coefficients)
{res}{txt}(model 2 has zero variance coefficients)
{res}{txt}(pooled model has zero variance coefficients)
{res}
{txt}Blinder-Oaxaca decomposition

{col 1}{lalign 16:Number of strata}{col 17} = {res}{ralign 3:2}{txt}{col 52}{lalign 15:Number of obs}{col 67} = {res}{ralign 9:9,476}
{txt}{col 1}{lalign 16:Number of PSUs}{col 17} = {res}{ralign 3:444}{txt}{col 52}{lalign 15:Population size}{col 67} = {res}{ralign 9:5,434,095}
{txt}{col 52}{lalign 15:Design df}{col 67} = {res}{ralign 9:442}
{txt}{col 49}Model{col 67}={col 69}    {res}linear
{txt}Group 1: Sex = {res}1{txt}{col 49}N of obs 1{col 67}={col 69}{res}     6,730
{txt}Group 2: Sex = {res}2{txt}{col 49}N of obs 2{col 67}={col 69}{res}     2,746

{txt}    explained: (X1 - X2) * {bf:b}
  unexplained: X1 * (b1 - {bf:b}) + X2 * ({bf:b} - b2)
               with {bf:b} from pooled model (including group dummy)

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Linearized
{col 1}  lnSelfWage{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}overall      {txt}{c |}
{space 5}group_1 {c |}{col 14}{res}{space 2} 9.522439{col 26}{space 2} .0193978{col 37}{space 1}  490.90{col 46}{space 3}0.000{col 54}{space 4} 9.484315{col 67}{space 3} 9.560562
{txt}{space 5}group_2 {c |}{col 14}{res}{space 2} 8.871629{col 26}{space 2}  .036041{col 37}{space 1}  246.15{col 46}{space 3}0.000{col 54}{space 4} 8.800796{col 67}{space 3} 8.942462
{txt}{space 2}difference {c |}{col 14}{res}{space 2} .6508095{col 26}{space 2} .0386777{col 37}{space 1}   16.83{col 46}{space 3}0.000{col 54}{space 4} .5747945{col 67}{space 3} .7268245
{txt}{space 3}explained {c |}{col 14}{res}{space 2}-.0363883{col 26}{space 2} .0178538{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0714772{col 67}{space 3}-.0012995
{txt}{space 1}unexplained {c |}{col 14}{res}{space 2} .6871978{col 26}{space 2} .0411772{col 37}{space 1}   16.69{col 46}{space 3}0.000{col 54}{space 4} .6062703{col 67}{space 3} .7681253
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}explained    {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2}-.0011002{col 26}{space 2} .0035387{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4} -.008055{col 67}{space 3} .0058545
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0238147{col 26}{space 2} .0106268{col 37}{space 1}    2.24{col 46}{space 3}0.026{col 54}{space 4} .0029294{col 67}{space 3} .0447001
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2} .0004109{col 26}{space 2} .0007206{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-.0010054{col 67}{space 3} .0018273
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2} .0014662{col 26}{space 2} .0010238{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4} -.000546{col 67}{space 3} .0034784
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0014827{col 26}{space 2} .0033394{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.0050805{col 67}{space 3} .0080458
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2}-.0017411{col 26}{space 2} .0021455{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4}-.0059577{col 67}{space 3} .0024756
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0013362{col 26}{space 2} .0015386{col 37}{space 1}    0.87{col 46}{space 3}0.386{col 54}{space 4}-.0016877{col 67}{space 3} .0043601
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2}-.0051791{col 26}{space 2} .0042379{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4} -.013508{col 67}{space 3} .0031498
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0006491{col 26}{space 2} .0022732{col 37}{space 1}    0.29{col 46}{space 3}0.775{col 54}{space 4}-.0038184{col 67}{space 3} .0051167
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0027812{col 26}{space 2} .0039429{col 37}{space 1}    0.71{col 46}{space 3}0.481{col 54}{space 4}-.0049679{col 67}{space 3} .0105303
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2}-.0005413{col 26}{space 2} .0016437{col 37}{space 1}   -0.33{col 46}{space 3}0.742{col 54}{space 4}-.0037717{col 67}{space 3} .0026892
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .0548243{col 26}{space 2} .0164206{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0225521{col 67}{space 3} .0870964
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2}-.1080925{col 26}{space 2} .0192227{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.1458717{col 67}{space 3}-.0703133
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0064769{col 26}{space 2} .0045461{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-.0154115{col 67}{space 3} .0024578
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2}  .000105{col 26}{space 2} .0005468{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4}-.0009697{col 67}{space 3} .0011797
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2}-.0001276{col 26}{space 2} .0006167{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.0013398{col 67}{space 3} .0010845
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}unexplained  {txt}{c |}
{space 1}dum_GenEdu2 {c |}{col 14}{res}{space 2} .1693065{col 26}{space 2} .0938485{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0151383{col 67}{space 3} .3537514
{txt}{space 1}dum_GenEdu3 {c |}{col 14}{res}{space 2} .0394788{col 26}{space 2} .0222431{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0042365{col 67}{space 3} .0831942
{txt}dum_TechEdu2 {c |}{col 14}{res}{space 2}-.0014452{col 26}{space 2} .0010663{col 37}{space 1}   -1.36{col 46}{space 3}0.176{col 54}{space 4}-.0035408{col 67}{space 3} .0006503
{txt}dum_TechEdu3 {c |}{col 14}{res}{space 2}  .000585{col 26}{space 2} .0004947{col 37}{space 1}    1.18{col 46}{space 3}0.238{col 54}{space 4}-.0003872{col 67}{space 3} .0015573
{txt}{space 1}dum_HHSize2 {c |}{col 14}{res}{space 2} .0362904{col 26}{space 2} .0439533{col 37}{space 1}    0.83{col 46}{space 3}0.409{col 54}{space 4} -.050093{col 67}{space 3} .1226739
{txt}{space 1}dum_HHSize3 {c |}{col 14}{res}{space 2} .0050878{col 26}{space 2} .0093969{col 37}{space 1}    0.54{col 46}{space 3}0.588{col 54}{space 4}-.0133805{col 67}{space 3}  .023556
{txt}{space 1}dum_HHSize4 {c |}{col 14}{res}{space 2} .0005226{col 26}{space 2} .0006688{col 37}{space 1}    0.78{col 46}{space 3}0.435{col 54}{space 4}-.0007919{col 67}{space 3} .0018371
{txt}{space 1}dum_HHSize5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
dum_Trained2 {c |}{col 14}{res}{space 2} .0671514{col 26}{space 2} .0277349{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} .0126427{col 67}{space 3} .1216602
{txt}{space 5}dum_SG2 {c |}{col 14}{res}{space 2} .0367146{col 26}{space 2} .0192993{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0012153{col 67}{space 3} .0746444
{txt}{space 5}dum_SG3 {c |}{col 14}{res}{space 2} .0819764{col 26}{space 2} .0910469{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.0969623{col 67}{space 3} .2609151
{txt}{space 5}dum_SG4 {c |}{col 14}{res}{space 2} .0261455{col 26}{space 2} .0239561{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-.0209365{col 67}{space 3} .0732275
{txt}dum_MarStat2 {c |}{col 14}{res}{space 2} .1259076{col 26}{space 2} .0746821{col 37}{space 1}    1.69{col 46}{space 3}0.093{col 54}{space 4}-.0208685{col 67}{space 3} .2726838
{txt}dum_MarStat3 {c |}{col 14}{res}{space 2} .0128664{col 26}{space 2} .0172518{col 37}{space 1}    0.75{col 46}{space 3}0.456{col 54}{space 4}-.0210393{col 67}{space 3} .0467722
{txt}dum_MarStat4 {c |}{col 14}{res}{space 2}-.0090407{col 26}{space 2}  .004931{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-.0187319{col 67}{space 3} .0006505
{txt}{space 4}Age_cont {c |}{col 14}{res}{space 2} .0216266{col 26}{space 2}  .082814{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-.1411315{col 67}{space 3} .1843848
{txt}{space 1}Age_sq_cont {c |}{col 14}{res}{space 2} -.008515{col 26}{space 2} .0441338{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.0952531{col 67}{space 3} .0782231
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .082539{col 26}{space 2}  .195917{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.3025056{col 67}{space 3} .4675835
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. * --- 10. END OF SCRIPT ---
. 
. display "--- Analysis Complete. Closing log file. ---"
{res}--- Analysis Complete. Closing log file. ---
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}X:\Career\Github\Pay_Equity_Analysis_Project\STATA Commands\dissertation_analysis_outputs.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Nov 2025, 23:20:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}